maindishrecipes.org
#+SETUPFILE: ./setup/maindishrecipes.setup
#+TITLE: Main Dish Recipes (HOMEPAGE LINK: https://www.musimatic.xyz)
#+OPTIONS: num:nil
* README For "Main Dish Recipes":
NOTE: These are recipes that I have gathered from the internet, and are mostly NOT my own.

I will indicate my own recipes with a "By: Samuel Banya" section in its title whenever
necessary.

This being noted, I have the related links whenever possible to the original creators, so
feel free to visit those links to find out even more great food recipes.

I am including them here in one quick and accessible page for myself, but also for you to
enjoy in plain-text format to be read on any device, courtesy of Emacs Org Mode :)
* Burma Superstar Style Tea Leaf Salad Recipe
** Link:
- https://www.mercurynews.com/2017/04/15/recipe-burma-superstars-tea-leaf-salad/
** Ingredients For Tea Leaf Dressing:
- 1/2 cup packed cup (about 2 ounces) whole fermented tea leaves (laphet) or 1/3 cup packed seasoned tea leaf paste (without oil)
- 1/3 cup canola oil
- 1 garlic clove, coarsely chopped
- 1/4 teaspoon dried chile flakes
- 1 teaspoon lime or lemon juice
- Salt
** Directions For Tea Leaf Dressing:
1. If using whole, unseasoned laphet leaves, soak them for 5 minutes in cold water to extract some of the bitterness.

2. Drain, squeezing the leaves to remove excess water.

3. Taste the leaves. If they still taste extremely bitter, soak and drain again.

4. Skip this step if using a seasoned paste.

5. Put the leaves or paste in a food processor with the garlic and chile flakes; pulse a few times.

6. Add the lemon juice and half the oil, briefly pulse.

7. Then, with the processor running, drizzle in the rest of the oil.

8. If the leaves are not preseasoned, add 1 teaspoon salt.

9. If the leaves are already seasoned, add only a pinch or two of salt.
** Ingredients For Fried Garlic Chips and Garlic Oil:
- 1/2 cup canola oil
- 1/3 cup thinly sliced fresh garlic
** Directions For Fried Garlic Chips And Garlic Oil:
1. Line a heatproof bowl with a strainer.

2. Line a plate with paper towels.

3. In a wok or small saucepan, heat the oil over medium heat for a minute or two (the oil shouldn’t be scorching hot).

4. Add garlic and gently stir.

5. When bubbles start to form rapidly around the garlic, decrease heat to low and cook.

6. Stir often, until the garlic is an even golden color and nearly completely crisp, about 3 minutes.

7. If the garlic starts to darken too quickly, remove it from the heat and let it continue to fry in the oil.

8. Garlic and oil into the strainer.

9. Lift the strainer up and shake off the excess oil.

10. Scatter garlic onto the lined plate.

11. The garlic should crisp up as it cools.

12. The chips can be stored in an airtight container at room temperature for 1 month.

13. Refrigerate the oil up to 6 months.
