maindishrecipes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-30 Mon 11:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Main Dish Recipes (HOMEPAGE LINK: https://www.musimatic.xyz)</title>
<meta name="author" content="Samuel Banya" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/maindishrecipes.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Main Dish Recipes (HOMEPAGE LINK: <a href="https://www.musimatic.xyz">https://www.musimatic.xyz</a>)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3345811">README For "Main Dish Recipes":</a></li>
<li><a href="#org2e368fc">Burma Superstar Style Tea Leaf Salad Recipe</a>
<ul>
<li><a href="#org3efacde">Link:</a></li>
<li><a href="#orgd49dd8c">Ingredients For Tea Leaf Dressing:</a></li>
<li><a href="#org8dd3055">Directions For Tea Leaf Dressing:</a></li>
<li><a href="#orgb6b4d4a">Ingredients For Fried Garlic Chips and Garlic Oil:</a></li>
<li><a href="#org7cfed61">Directions For Fried Garlic Chips And Garlic Oil:</a></li>
<li><a href="#orgc0ddacd">Ingredients For Fried Yellow Split Peas:</a></li>
<li><a href="#orgfed5119">Directions For Fried Yellow Split Peas:</a></li>
<li><a href="#org30c04ea">Ingredients For Tea Leaf Salad</a></li>
<li><a href="#orge255dd5">Directions For Assembling The Tea Leaf Salad:</a></li>
</ul>
</li>
<li><a href="#org30fa437">Cheeseburger Casserole Recipe</a>
<ul>
<li><a href="#org9aad34e">Links:</a></li>
<li><a href="#org88ac934">Ingredients:</a></li>
<li><a href="#orge9c579e">Directions:</a></li>
</ul>
</li>
<li><a href="#org5637094">Chicken Fried Steak Recipe</a>
<ul>
<li><a href="#org4284452">Link:</a></li>
<li><a href="#orgfa1f716">Ingredients (Chicken Fried Steak):</a></li>
<li><a href="#org9b64a0f">Ingredients (Gravy):</a></li>
<li><a href="#org242c0f7">Directions:</a></li>
</ul>
</li>
<li><a href="#org06fb909">Deep Dish Pizza Recipe</a>
<ul>
<li><a href="#orgfc225fd">Link:</a></li>
<li><a href="#org7063ee0">Dough Ingredients:</a></li>
<li><a href="#orgc446be8">Sauce Ingredients:</a></li>
<li><a href="#org31fc327">Sausage Ingredients:</a></li>
<li><a href="#orgbd9653d">Directions To Prepare Sauce:</a></li>
<li><a href="#org55a3074">Directions To Prepare Sausage:</a></li>
<li><a href="#org93fcd43">Directions To Prepare Entire Pizza:</a></li>
</ul>
</li>
<li><a href="#org3211ed7">Gluten Free Bread Recipe</a>
<ul>
<li><a href="#org82821aa">Link:</a></li>
<li><a href="#org54591bc">Ingredients:</a></li>
<li><a href="#org7bdd4e5">Directions:</a></li>
</ul>
</li>
<li><a href="#org699ca4f">Gnocchi Recipe From Gennaro Contaldo</a>
<ul>
<li><a href="#org0ac4ef2">Links:</a>
<ul>
<li><a href="#orge56ad42">Recipe Link:</a></li>
<li><a href="#org898bee8">YouTube Video Links:</a></li>
</ul>
</li>
<li><a href="#org744a5e3">Ingredients:</a>
<ul>
<li><a href="#org00ad666">Gnocci Ingredients:</a></li>
<li><a href="#orgcc37dae">Sage Butter Sauce Ingredients:</a></li>
</ul>
</li>
<li><a href="#org325655a">Directions:</a></li>
</ul>
</li>
<li><a href="#orgea5dae9">Goulash Recipe</a>
<ul>
<li><a href="#orgd953119">Link:</a></li>
<li><a href="#org9f1eff4">Ingredients:</a></li>
<li><a href="#org0239e26">Optional Ingredients:</a></li>
<li><a href="#org2ee7ef0">Directions:</a></li>
</ul>
</li>
<li><a href="#orga4a28f7">Hawaiian Chicken Casserole Recipe</a>
<ul>
<li><a href="#org64b837f">Links:</a></li>
<li><a href="#org12b18b6">Ingredients:</a></li>
<li><a href="#org056c93f">Directions:</a></li>
</ul>
</li>
<li><a href="#org21b54bd">Instant Pot Chicken Taco Bowls</a>
<ul>
<li><a href="#orgaa12b51">Link:</a></li>
<li><a href="#org724c1e5">Ingredients</a></li>
<li><a href="#org00ab1b0">Directions</a></li>
</ul>
</li>
<li><a href="#orgfd80c85">Instant Pot Mac And Cheese Recipe</a>
<ul>
<li><a href="#org12bcc03">Links:</a></li>
<li><a href="#org1ccde64">Ingredients:</a></li>
<li><a href="#org2142d6b">Directions:</a></li>
</ul>
</li>
<li><a href="#orgbe430d2">Italian Style Green Bean Casserole Recipe</a>
<ul>
<li><a href="#org3fd4424">Links:</a></li>
<li><a href="#org259baf5">Ingredients:</a></li>
<li><a href="#org9e304d3">Directions:</a></li>
</ul>
</li>
<li><a href="#org5fbcf03">Kale Pie Recipe</a>
<ul>
<li><a href="#orgbaa96de">Link:</a></li>
</ul>
</li>
<li><a href="#org92b7b31">Langos Recipe</a>
<ul>
<li><a href="#org26d08a4">Link:</a></li>
<li><a href="#org8eba237">Ingredients:</a></li>
<li><a href="#org280dfd2">Directions:</a></li>
</ul>
</li>
<li><a href="#org5ecb488">Overnight Oats Recipe</a>
<ul>
<li><a href="#orgb558b9d">Link:</a></li>
<li><a href="#orgc0785fa">Ingredients:</a></li>
<li><a href="#orgbdda298">Directions:</a></li>
</ul>
</li>
<li><a href="#org2bee52e">Meatball Stroganoff Recipe (One-Pot)</a>
<ul>
<li><a href="#orgfe81c10">Link:</a></li>
<li><a href="#orge15830a">Ingredients:</a></li>
<li><a href="#org5261075">Directions:</a></li>
</ul>
</li>
<li><a href="#org71fcfb0">Nokedli Recipe</a>
<ul>
<li><a href="#orgcb455ad">Link:</a></li>
<li><a href="#org709e2e3">Ingredients (converted from metric to imperial units)</a></li>
<li><a href="#org9001f5f">Directions:</a></li>
</ul>
</li>
<li><a href="#org064fbf7">Philly Mac And Cheese Steak Casserole Recipe</a>
<ul>
<li><a href="#org58604bc">Links:</a></li>
<li><a href="#org1635251">Ingredients:</a></li>
<li><a href="#orge123f26">Directions:</a></li>
</ul>
</li>
<li><a href="#org48eddf4">Pho Recipe</a>
<ul>
<li><a href="#orgea80bdd">Link:</a></li>
<li><a href="#org4572e20">Ingredients:</a>
<ul>
<li><a href="#orgeb1cf90">Broth</a></li>
<li><a href="#orgdd98932">For Serving</a></li>
</ul>
</li>
<li><a href="#orgfa53284">Directions:</a></li>
</ul>
</li>
<li><a href="#orgbcb40fa">Pogacsa Recipe</a>
<ul>
<li><a href="#orgc368694">Link:</a></li>
<li><a href="#orgeef9afb">Ingredients:</a></li>
<li><a href="#org1a573f9">Topping Ingredients:</a></li>
<li><a href="#orgdd3f7b5">Directions:</a></li>
</ul>
</li>
<li><a href="#org6da24f4">Porkolt Recipe</a>
<ul>
<li><a href="#orgaadee89">Link:</a></li>
<li><a href="#org5627817">Ingredients:</a></li>
<li><a href="#org67db95b">Directions:</a></li>
</ul>
</li>
<li><a href="#orgd3bb337">Rakott Krumpli (Hungarian Layered Potatoes) Recipe</a>
<ul>
<li><a href="#org5d834fb">Link:</a></li>
<li><a href="#org14891bf">Ingredients (Serves 6):</a></li>
<li><a href="#org97a3bb8">Directions:</a></li>
</ul>
</li>
<li><a href="#org5aff4d6">Sausage Gravy Breakfast Pizza</a>
<ul>
<li><a href="#orged253f4">Link:</a></li>
<li><a href="#org522d3a3">Ingredients:</a></li>
<li><a href="#orgcb32eb4">Directions:</a></li>
</ul>
</li>
<li><a href="#org85606d5">Smoked Salmons And Chive Soda Bread</a>
<ul>
<li><a href="#org9379082">Link:</a></li>
<li><a href="#org836c9e2">Ingredients:</a>
<ul>
<li><a href="#org83539cf">For the bread:</a></li>
<li><a href="#orgb554659">For the dill and black garlic butter:</a></li>
</ul>
</li>
<li><a href="#org9dcdee5">Directions:</a></li>
</ul>
</li>
<li><a href="#orgedd348f">Stuffed Peppers Recipe</a>
<ul>
<li><a href="#orgd698816">Link:</a></li>
<li><a href="#orgb73a75f">Ingredients:</a></li>
<li><a href="#org70c365b">Directions:</a></li>
</ul>
</li>
<li><a href="#org624a015">Toltott Kaposzta (Hungarian Stuffed Cabbage)</a>
<ul>
<li><a href="#org30f633a">Link:</a></li>
<li><a href="#org960c82c">Ingredients:</a></li>
<li><a href="#org5c78dce">Directions:</a></li>
</ul>
</li>
<li><a href="#org052eaea">Taco Cake Recipe</a>
<ul>
<li><a href="#org7844d6a">Link:</a></li>
</ul>
</li>
<li><a href="#orga914005">Tiger Bread Recipe</a>
<ul>
<li><a href="#orgfcc81ff">YouTube Video Link:</a></li>
<li><a href="#orgd5df307">Ingredients:</a>
<ul>
<li><a href="#orgd9563da">For The Dough</a></li>
<li><a href="#org03a6667">For the topping</a></li>
</ul>
</li>
<li><a href="#orgb298640">Directions:</a></li>
</ul>
</li>
<li><a href="#orgfd9b2c3">Turkey Meatloaf Recipe</a>
<ul>
<li><a href="#orgd206a13">Link:</a></li>
<li><a href="#org58b90c2">Ingredients:</a>
<ul>
<li><a href="#org9941138">Meatloaf Ingredients:</a></li>
<li><a href="#orga23ae71">Topping Ingredients:</a></li>
</ul>
</li>
<li><a href="#orgb0e9b67">Directions:</a></li>
</ul>
</li>
<li><a href="#orgacfc851">Zöldbab Krémmel Greenbeans With Cream Recipe</a>
<ul>
<li><a href="#org618c9d0">Link:</a></li>
<li><a href="#org00117dd">Ingredients:</a></li>
<li><a href="#org49a2c29">Directions:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3345811" class="outline-2">
<h2 id="org3345811">README For "Main Dish Recipes":</h2>
<div class="outline-text-2" id="text-org3345811">
<p>
NOTE: These are recipes that I have gathered from the internet, and are mostly NOT my own.
</p>

<p>
I will indicate my own recipes with a "By: Samuel Banya" section in its title whenever
necessary.
</p>

<p>
This being noted, I have the related links whenever possible to the original creators, so
feel free to visit those links to find out even more great food recipes.
</p>

<p>
I am including them here in one quick and accessible page for myself, but also for you to
enjoy in plain-text format to be read on any device, courtesy of Emacs Org Mode :)
</p>
</div>
</div>
<div id="outline-container-org2e368fc" class="outline-2">
<h2 id="org2e368fc">Burma Superstar Style Tea Leaf Salad Recipe</h2>
<div class="outline-text-2" id="text-org2e368fc">
</div>
<div id="outline-container-org3efacde" class="outline-3">
<h3 id="org3efacde">Link:</h3>
<div class="outline-text-3" id="text-org3efacde">
<ul class="org-ul">
<li><a href="https://www.mercurynews.com/2017/04/15/recipe-burma-superstars-tea-leaf-salad/">https://www.mercurynews.com/2017/04/15/recipe-burma-superstars-tea-leaf-salad/</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd49dd8c" class="outline-3">
<h3 id="orgd49dd8c">Ingredients For Tea Leaf Dressing:</h3>
<div class="outline-text-3" id="text-orgd49dd8c">
<ul class="org-ul">
<li>1/2 cup packed cup (about 2 ounces) whole fermented tea leaves (laphet) or 1/3 cup packed seasoned tea leaf paste (without oil)</li>
<li>1/3 cup canola oil</li>
<li>1 garlic clove, coarsely chopped</li>
<li>1/4 teaspoon dried chile flakes</li>
<li>1 teaspoon lime or lemon juice</li>
<li>Salt</li>
</ul>
</div>
</div>
<div id="outline-container-org8dd3055" class="outline-3">
<h3 id="org8dd3055">Directions For Tea Leaf Dressing:</h3>
<div class="outline-text-3" id="text-org8dd3055">
<ol class="org-ol">
<li>If using whole, unseasoned laphet leaves, soak them for 5 minutes in cold water to extract some of the bitterness.</li>

<li>Drain, squeezing the leaves to remove excess water.</li>

<li>Taste the leaves. If they still taste extremely bitter, soak and drain again.</li>

<li>Skip this step if using a seasoned paste.</li>

<li>Put the leaves or paste in a food processor with the garlic and chile flakes; pulse a few times.</li>

<li>Add the lemon juice and half the oil, briefly pulse.</li>

<li>Then, with the processor running, drizzle in the rest of the oil.</li>

<li>If the leaves are not preseasoned, add 1 teaspoon salt.</li>

<li>If the leaves are already seasoned, add only a pinch or two of salt.</li>
</ol>
</div>
</div>
<div id="outline-container-orgb6b4d4a" class="outline-3">
<h3 id="orgb6b4d4a">Ingredients For Fried Garlic Chips and Garlic Oil:</h3>
<div class="outline-text-3" id="text-orgb6b4d4a">
<ul class="org-ul">
<li>1/2 cup canola oil</li>
<li>1/3 cup thinly sliced fresh garlic</li>
</ul>
</div>
</div>
<div id="outline-container-org7cfed61" class="outline-3">
<h3 id="org7cfed61">Directions For Fried Garlic Chips And Garlic Oil:</h3>
<div class="outline-text-3" id="text-org7cfed61">
<ol class="org-ol">
<li>Line a heatproof bowl with a strainer.</li>

<li>Line a plate with paper towels.</li>

<li>In a wok or small saucepan, heat the oil over medium heat for a minute or two (the oil shouldn’t be scorching hot).</li>

<li>Add garlic and gently stir.</li>

<li>When bubbles start to form rapidly around the garlic, decrease heat to low and cook.</li>

<li>Stir often, until the garlic is an even golden color and nearly completely crisp, about 3 minutes.</li>

<li>If the garlic starts to darken too quickly, remove it from the heat and let it continue to fry in the oil.</li>

<li>Garlic and oil into the strainer.</li>

<li>Lift the strainer up and shake off the excess oil.</li>

<li>Scatter garlic onto the lined plate.</li>

<li>The garlic should crisp up as it cools.</li>

<li>The chips can be stored in an airtight container at room temperature for 1 month.</li>

<li>Refrigerate the oil up to 6 months.</li>
</ol>
</div>
</div>
