maindishrecipes.org
** Ingredients For Fried Yellow Split Peas:
- 1/3 cup yellow split peas
- 1/2 cup canola oil
- Pinch of salt
** Directions For Fried Yellow Split Peas:
1. Place peas in a bowl and cover 1 inch of water.

2. Soak at least 4 hours or overnight.

3. Drain split peas through a fine-mesh strainer, shaking off the excess water.

4. Line a plate with paper towels.

5. In a wok or small saucepan, heat the oil over medium-high heat for 1 minute.

6. Add the split peas.

7. Once the oil starts to bubble rapidly around the split peas, lower the heat slightly and continue to fry.

8. Stir often, until they begin to crisp up and turn slightly darker, about 5 minutes.

9. Drain well.

10. Scatter the split peas on the lined plate and season with salt.

11. The split peas should be crunchy, but not rock-hard, once cooled.

12. Store in an airtight container at room temperature for up to 2 weeks.
** Ingredients For Tea Leaf Salad
- 6 cups thinly sliced romaine lettuce (about 1 1/2 heads romaine)
- 1/2 cup tea leaf dressing (see recipe)
- 1/4 cup fried garlic chips (see recipe)
- 1/4 cup fried yellow split peas (see recipe)
- 1/4 cup coarsely chopped toasted peanuts
- 1/4 cup toasted sunflower seeds
- 1 tablespoon toasted sesame seeds
- 1 Roma tomato, seeded and diced
- 1 small jalapeño, seeded and diced (about 1/4 cup)
- 1 tablespoon shrimp powder
- 2 teaspoons fish sauce or a few generous pinches salt
- 1 lemon or lime, cut into wedges
** Directions For Assembling The Tea Leaf Salad:
1. Place a bed of lettuce in the center of a large platter.

2. Spoon the tea leaf dressing into the center of the lettuce.

3. Around the lettuce, arrange separate piles of fried garlic, split peas, peanuts, sunflower seeds, sesame seeds, tomato and jalapeño.

4. Sprinkle with shrimp powder and drizzle with fish sauce.

5. Before serving, squeeze 2 lemon wedges over the plate.

6. Using 2 forks, mix the ingredients together until the tea leaves lightly coat the lettuce.

7. Taste, adding more lemon or fish sauce at the table, if desired.
* Cheeseburger Casserole Recipe
** Links:
- https://www.myrecipes.com/recipe/cheeseburger-casserole
- https://www.youtube.com/watch?v=_wZkmBUkdbE
** Ingredients:
- 6 thick-cut bacon slices, chopped
- 2 large yellow onions, thinly sliced
- 1 Tbsp. Worcestershire sauce
- 1 1/4 tsp. kosher salt, divided
- 1 tsp. black pepper, divided
- 1 1/2 lb. (90/10 lean) ground beef sirloin
- 1/4 cup ketchup
- 2 Tbsp. yellow mustard
- 8 (3/4-oz.) American cheese slices
- 3 brioche hamburger buns, cut in 3/4-in. cubes
- 4 oz. sharp Cheddar cheese, shredded (about 1 cup)
- Shredded lettuce, diced tomato, pickle slices, mayonnaise
** Directions:
1. Cook bacon in a large nonstick skillet over medium, stirring occasionally, until browned and crisp.

2. Transfer to a plate; set aside.

3. Pour off half of the bacon drippings from skillet, and reserve.

4. Add onions to skillet with remaining drippings over medium-low; cook, stirring occasionally, until browned and caramelized, about 30 minutes.

5. Stir in Worcestershire, 1/2 teaspoon of the salt, and 1/4 teaspoon of the pepper.

6. Transfer to a bowl; set aside.

7. Preheat oven to 350°F.

8. Heat skillet over medium-high.

9. Add ground beef, 1/2 teaspoon of the pepper, and remaining 3/4 teaspoon salt; cook, stirring occasionally, until browned, 8 to 10 mintues.

10. Stir in ketchup and mustard; remove from heat.

11. Spread beef mixture in bottom of a lightly greased 3-quart baking dish.

12. Top with caramelized onions and crumbled bacon.

13. Arrange cheese slices over bacon.

14. Toss bun cubes in reserved bacon drippings, and place in an even layer over cheese slices.

15. Sprinkle with cheddar cheese and remaining 1/4 teaspoon pepper.

16. Bake in preheated oven until golden and bubbly, about 20 minutes.

17. Serve with desired toppings.
* Chicken Fried Steak Recipe
** Link:
- https://www.foodnetwork.com/recipes/ree-drummond/chicken-fried-steak-with-gravy-recipe-1925056
** Ingredients (Chicken Fried Steak):
- 1 1/2 cups whole milk
- 2 large eggs
- 2 cups all-purpose flour
- 2 teaspoons seasoned salt
- Freshly ground black pepper
- 3/4 teaspoon paprika
- 1/4 teaspoon cayenne pepper
- 3 pounds cube steak (tenderized round steak that's been extra tenderized)
- Kosher salt
- 1/2 cup canola or vegetable oil
- 1 tablespoon butter
** Ingredients (Gravy):
- 1/3 cup all-purpose flour
- 3 to 4 cups whole milk
- 1/2 teaspoon seasoned salt
- Freshly ground black pepper
- Mashed potatoes, for serving
