maindishrecipes.html
<div id="outline-container-orgc0ddacd" class="outline-3">
<h3 id="orgc0ddacd">Ingredients For Fried Yellow Split Peas:</h3>
<div class="outline-text-3" id="text-orgc0ddacd">
<ul class="org-ul">
<li>1/3 cup yellow split peas</li>
<li>1/2 cup canola oil</li>
<li>Pinch of salt</li>
</ul>
</div>
</div>
<div id="outline-container-orgfed5119" class="outline-3">
<h3 id="orgfed5119">Directions For Fried Yellow Split Peas:</h3>
<div class="outline-text-3" id="text-orgfed5119">
<ol class="org-ol">
<li>Place peas in a bowl and cover 1 inch of water.</li>

<li>Soak at least 4 hours or overnight.</li>

<li>Drain split peas through a fine-mesh strainer, shaking off the excess water.</li>

<li>Line a plate with paper towels.</li>

<li>In a wok or small saucepan, heat the oil over medium-high heat for 1 minute.</li>

<li>Add the split peas.</li>

<li>Once the oil starts to bubble rapidly around the split peas, lower the heat slightly and continue to fry.</li>

<li>Stir often, until they begin to crisp up and turn slightly darker, about 5 minutes.</li>

<li>Drain well.</li>

<li>Scatter the split peas on the lined plate and season with salt.</li>

<li>The split peas should be crunchy, but not rock-hard, once cooled.</li>

<li>Store in an airtight container at room temperature for up to 2 weeks.</li>
</ol>
</div>
</div>
<div id="outline-container-org30c04ea" class="outline-3">
<h3 id="org30c04ea">Ingredients For Tea Leaf Salad</h3>
<div class="outline-text-3" id="text-org30c04ea">
<ul class="org-ul">
<li>6 cups thinly sliced romaine lettuce (about 1 1/2 heads romaine)</li>
<li>1/2 cup tea leaf dressing (see recipe)</li>
<li>1/4 cup fried garlic chips (see recipe)</li>
<li>1/4 cup fried yellow split peas (see recipe)</li>
<li>1/4 cup coarsely chopped toasted peanuts</li>
<li>1/4 cup toasted sunflower seeds</li>
<li>1 tablespoon toasted sesame seeds</li>
<li>1 Roma tomato, seeded and diced</li>
<li>1 small jalapeño, seeded and diced (about 1/4 cup)</li>
<li>1 tablespoon shrimp powder</li>
<li>2 teaspoons fish sauce or a few generous pinches salt</li>
<li>1 lemon or lime, cut into wedges</li>
</ul>
</div>
</div>
<div id="outline-container-orge255dd5" class="outline-3">
<h3 id="orge255dd5">Directions For Assembling The Tea Leaf Salad:</h3>
<div class="outline-text-3" id="text-orge255dd5">
<ol class="org-ol">
<li>Place a bed of lettuce in the center of a large platter.</li>

<li>Spoon the tea leaf dressing into the center of the lettuce.</li>

<li>Around the lettuce, arrange separate piles of fried garlic, split peas, peanuts, sunflower seeds, sesame seeds, tomato and jalapeño.</li>

<li>Sprinkle with shrimp powder and drizzle with fish sauce.</li>

<li>Before serving, squeeze 2 lemon wedges over the plate.</li>

<li>Using 2 forks, mix the ingredients together until the tea leaves lightly coat the lettuce.</li>

<li>Taste, adding more lemon or fish sauce at the table, if desired.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org30fa437" class="outline-2">
<h2 id="org30fa437">Cheeseburger Casserole Recipe</h2>
<div class="outline-text-2" id="text-org30fa437">
</div>
<div id="outline-container-org9aad34e" class="outline-3">
<h3 id="org9aad34e">Links:</h3>
<div class="outline-text-3" id="text-org9aad34e">
<ul class="org-ul">
<li><a href="https://www.myrecipes.com/recipe/cheeseburger-casserole">https://www.myrecipes.com/recipe/cheeseburger-casserole</a></li>
<li><a href="https://www.youtube.com/watch?v=_wZkmBUkdbE">https://www.youtube.com/watch?v=_wZkmBUkdbE</a></li>
</ul>
</div>
</div>
<div id="outline-container-org88ac934" class="outline-3">
<h3 id="org88ac934">Ingredients:</h3>
<div class="outline-text-3" id="text-org88ac934">
<ul class="org-ul">
<li>6 thick-cut bacon slices, chopped</li>
<li>2 large yellow onions, thinly sliced</li>
<li>1 Tbsp. Worcestershire sauce</li>
<li>1 1/4 tsp. kosher salt, divided</li>
<li>1 tsp. black pepper, divided</li>
<li>1 1/2 lb. (90/10 lean) ground beef sirloin</li>
<li>1/4 cup ketchup</li>
<li>2 Tbsp. yellow mustard</li>
<li>8 (3/4-oz.) American cheese slices</li>
<li>3 brioche hamburger buns, cut in 3/4-in. cubes</li>
<li>4 oz. sharp Cheddar cheese, shredded (about 1 cup)</li>
<li>Shredded lettuce, diced tomato, pickle slices, mayonnaise</li>
</ul>
</div>
</div>
<div id="outline-container-orge9c579e" class="outline-3">
<h3 id="orge9c579e">Directions:</h3>
<div class="outline-text-3" id="text-orge9c579e">
<ol class="org-ol">
<li>Cook bacon in a large nonstick skillet over medium, stirring occasionally, until browned and crisp.</li>

<li>Transfer to a plate; set aside.</li>

<li>Pour off half of the bacon drippings from skillet, and reserve.</li>

<li>Add onions to skillet with remaining drippings over medium-low; cook, stirring occasionally, until browned and caramelized, about 30 minutes.</li>

<li>Stir in Worcestershire, 1/2 teaspoon of the salt, and 1/4 teaspoon of the pepper.</li>

<li>Transfer to a bowl; set aside.</li>

<li>Preheat oven to 350°F.</li>

<li>Heat skillet over medium-high.</li>

<li>Add ground beef, 1/2 teaspoon of the pepper, and remaining 3/4 teaspoon salt; cook, stirring occasionally, until browned, 8 to 10 mintues.</li>

<li>Stir in ketchup and mustard; remove from heat.</li>

<li>Spread beef mixture in bottom of a lightly greased 3-quart baking dish.</li>

<li>Top with caramelized onions and crumbled bacon.</li>

<li>Arrange cheese slices over bacon.</li>

<li>Toss bun cubes in reserved bacon drippings, and place in an even layer over cheese slices.</li>

<li>Sprinkle with cheddar cheese and remaining 1/4 teaspoon pepper.</li>

<li>Bake in preheated oven until golden and bubbly, about 20 minutes.</li>

<li>Serve with desired toppings.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org5637094" class="outline-2">
<h2 id="org5637094">Chicken Fried Steak Recipe</h2>
<div class="outline-text-2" id="text-org5637094">
</div>
<div id="outline-container-org4284452" class="outline-3">
<h3 id="org4284452">Link:</h3>
<div class="outline-text-3" id="text-org4284452">
<ul class="org-ul">
<li><a href="https://www.foodnetwork.com/recipes/ree-drummond/chicken-fried-steak-with-gravy-recipe-1925056">https://www.foodnetwork.com/recipes/ree-drummond/chicken-fried-steak-with-gravy-recipe-1925056</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgfa1f716" class="outline-3">
<h3 id="orgfa1f716">Ingredients (Chicken Fried Steak):</h3>
<div class="outline-text-3" id="text-orgfa1f716">
<ul class="org-ul">
<li>1 1/2 cups whole milk</li>
<li>2 large eggs</li>
<li>2 cups all-purpose flour</li>
<li>2 teaspoons seasoned salt</li>
<li>Freshly ground black pepper</li>
<li>3/4 teaspoon paprika</li>
<li>1/4 teaspoon cayenne pepper</li>
<li>3 pounds cube steak (tenderized round steak that's been extra tenderized)</li>
<li>Kosher salt</li>
<li>1/2 cup canola or vegetable oil</li>
<li>1 tablespoon butter</li>
</ul>
</div>
</div>
<div id="outline-container-org9b64a0f" class="outline-3">
<h3 id="org9b64a0f">Ingredients (Gravy):</h3>
<div class="outline-text-3" id="text-org9b64a0f">
<ul class="org-ul">
<li>1/3 cup all-purpose flour</li>
<li>3 to 4 cups whole milk</li>
<li>1/2 teaspoon seasoned salt</li>
<li>Freshly ground black pepper</li>
<li>Mashed potatoes, for serving</li>
</ul>
</div>
</div>
