maindishrecipes.org
** Directions:
1. For the steak: Begin with setting up an assembly line of dishes.

2. Mix the milk with the eggs in one; the flour mixed with the seasoned salt, 1 1/2 teaspoons black pepper, paprika and cayenne in another; and the meat in a third.

3. Then have one clean plate at the end to receive the breaded meat.

4. Work with one piece of meat at a time.

5. Sprinkle both sides with kosher salt and black pepper, then place it in the flour mixture.

6. Turn to coat.

7. Place the meat into the milk/egg mixture, turning to coat.

8. Finally, place it back in the flour and turn to coat (dry mixture/wet mixture/dry mixture).

9. Place the breaded meat on the clean plate, then repeat with the remaining meat.

10. Heat the oil in a large skillet over medium heat.

11. Add the butter.

12. Drop in a few sprinkles of flour to make sure it's sufficiently hot.

13. When the butter sizzles immediately, you know it's ready. (It should not brown right away, if it does, the fire is too hot.)

14. Cook the meat, 3 pieces at a time, until the edges start to look golden brown, about 2 minutes each side.

15. Remove the meat to a paper towel-lined plate and keep them warm by covering lightly with another plate or a sheet of foil.

16. Repeat until all the meat is cooked.

17. After all the meat is fried, pour off the grease into a heatproof bowl.

18. Without cleaning the skillet, return it to the stove over medium-low heat.

19. Add 1/4 cup of the grease back to the skillet and allow it to heat up.

20. For the gravy: When the grease is hot, sprinkle the flour evenly over the grease.

21. Using a whisk, mix the flour with the grease, creating a golden-brown paste.

22. Add more flour if it looks overly greasy; add a little more grease if it becomes too pasty/clumpy.

23. Keep cooking until the roux reaches a deep golden brown color.

24. Pour in the milk, whisking constantly.

25. Add the seasoned salt and black pepper to taste and cook, whisking, until the gravy is smooth and thick, 5 to 10 minutes.

26. Be prepared to add more milk if it becomes overly thick.

27. Be sure to taste to make sure gravy is sufficiently seasoned.

28. Serve the meat next to a big side of mashed potatoes.

29. Pour gravy over the whole shebang!

* Deep Dish Pizza Recipe
** Link:
- The 4 keys to make perfect CHICAGO DEEP DISH pizza every time (https://www.youtube.com/watch?v=89RYM6k0tKA)
** Dough Ingredients:
- 450g or about 3 1/4 cup flour
- 40g or 1/4 cup cornmeal
- 12g or 3 tsp sugar  15g or 3 tsp salt
- 275g or 1 1/4 cup water (85F)
- 110g or 8 tbsp (1 stick) butter cubed
- 9g or 3 tsp yeast
** Sauce Ingredients:
- 1 28oz can nice crushed tomato
- 1/4 red onion (grated)
- 2 garlic cloves ( run through press or minced)
- 40g or 2 tbps tomato paste
- 10g or 1 tbps sugar
- 1g or 1/2 tsp dried basil
- 1g or 1/2 tsp dried oregano
- 2-3 tbps butter
- 5g salt or 1 tsp
** Sausage Ingredients:
- 1 lb fatty ground pork
- 7g or 1.5 tsp salt
- 5g or 1 tsp sugar
- 3g or 1 tsp paprika
- 1g or 1/2 tsp dried sage
- 1g or 1/2 tsp black pepper
- 5g or 1.5 tsp red wine vinegar
- 1g or 1/2 tsp chile flake
- 1g or 1/2 tsp garlic powder
- 2g or 1 tsp toasted crushed fennel seed
** Directions To Prepare Sauce:
1. In a medium saute or sauce pan, preheat over medium heat, melt butter.

2. Add in onion and garlic and 5g salt, then sweat until translucent and starting to take on color.

3. Add in tomato paste and fry until rusty color emerges (30-40 seconds).

4. Add in crushed tomatoes, sugar, dried herbs and cook on low heat for 20 minutes stir often, cool for later pizza building.
** Directions To Prepare Sausage:
1. Fold ingredients to combine, cook a little off to taste for seasoning.
** Directions To Prepare Entire Pizza:
1. Combine dry ingredients in food processor, add in cubed butter and run food processor until incorporated and pebble-like.

2. While running, stream in warm water until combines, run for 30-40 seconds total.

3. Transfer to bowl and let rise for 90 minutes.

4. Divide into 2 equal pieces and shape into loose rounds, move to oiled sheet tray and cover with another sheet tray.

5. Let rise 1 hour.

6. Then roll into 12" round, oil a 9"-10 cast iron (LINK BELOW) or cake pan with 3 TBPS olive oil.

7. Lay in rolled out dough and then build pizza: CHEESE + SAUSAGE + SAUCE + PARM CHILE FLAKE .

6. Bake 30-40 minutes in 425 oven until crust is fried and golden.

7. Let cool 10 minutes then serve.

* Gluten Free Bread Recipe
** Link:
- https://www.goodforyouglutenfree.com/gluten-free-sandwich-bread/
** Ingredients:
- 3 cups Bob’s Red Mill 1-to-1 Gluten-Free Flour blend 430 grams
- 2 Tbsp light brown sugar
- 2 tsp instant yeast equivalent to one packet
- 2 tsp Kosher salt
- 1 cup warm milk or milk substitute
- 1 Tbsp raw honey
- 4 Tbsp soft butter or butter substitute
- 3 large eggs
** Directions:
1. Combine flour, brown sugar, yeast, salt in the bowl of your standing mixer.

2. Attach the paddle attachment to your standing mixer and slowly mix all ingredients on low speed.

3. Drizzle in milk, then add honey and butter and continue to mix well.

4. Turn mixer to medium speed and add each egg, one at a time until incorporated.

5. Once all the eggs are added, mix dough for 1 minute until all ingredients are well combined.

6. The batter will be sticky and soft (not like normal bread dough).

7. Grease an 8.5 x 4.5" loaf pan and gently pour dough into the pan without deflating it.

8. Cover with plastic wrap and place in warm spot to rise for 90-120 minutes.

9. Preheat oven to 350º F and bake for 38-40 minutes until the top is slightly browned and the dough is cooked through.

10. Place bread on a wire rack to cool completely.

11. Use a serrated bread knife to cut bread into slices.

12. The bread tastes fantastic toasted and lasts for several days when wrapped in plastic wrap.
* Gnocchi Recipe From Gennaro Contaldo
** Links:
*** Recipe Link:
- https://www.yellowmellowlife.com/gennaro-contaldos-gnocchi/

