maindishrecipes.html
<div id="outline-container-org242c0f7" class="outline-3">
<h3 id="org242c0f7">Directions:</h3>
<div class="outline-text-3" id="text-org242c0f7">
<ol class="org-ol">
<li>For the steak: Begin with setting up an assembly line of dishes.</li>

<li>Mix the milk with the eggs in one; the flour mixed with the seasoned salt, 1 1/2 teaspoons black pepper, paprika and cayenne in another; and the meat in a third.</li>

<li>Then have one clean plate at the end to receive the breaded meat.</li>

<li>Work with one piece of meat at a time.</li>

<li>Sprinkle both sides with kosher salt and black pepper, then place it in the flour mixture.</li>

<li>Turn to coat.</li>

<li>Place the meat into the milk/egg mixture, turning to coat.</li>

<li>Finally, place it back in the flour and turn to coat (dry mixture/wet mixture/dry mixture).</li>

<li>Place the breaded meat on the clean plate, then repeat with the remaining meat.</li>

<li>Heat the oil in a large skillet over medium heat.</li>

<li>Add the butter.</li>

<li>Drop in a few sprinkles of flour to make sure it's sufficiently hot.</li>

<li>When the butter sizzles immediately, you know it's ready. (It should not brown right away, if it does, the fire is too hot.)</li>

<li>Cook the meat, 3 pieces at a time, until the edges start to look golden brown, about 2 minutes each side.</li>

<li>Remove the meat to a paper towel-lined plate and keep them warm by covering lightly with another plate or a sheet of foil.</li>

<li>Repeat until all the meat is cooked.</li>

<li>After all the meat is fried, pour off the grease into a heatproof bowl.</li>

<li>Without cleaning the skillet, return it to the stove over medium-low heat.</li>

<li>Add 1/4 cup of the grease back to the skillet and allow it to heat up.</li>

<li>For the gravy: When the grease is hot, sprinkle the flour evenly over the grease.</li>

<li>Using a whisk, mix the flour with the grease, creating a golden-brown paste.</li>

<li>Add more flour if it looks overly greasy; add a little more grease if it becomes too pasty/clumpy.</li>

<li>Keep cooking until the roux reaches a deep golden brown color.</li>

<li>Pour in the milk, whisking constantly.</li>

<li>Add the seasoned salt and black pepper to taste and cook, whisking, until the gravy is smooth and thick, 5 to 10 minutes.</li>

<li>Be prepared to add more milk if it becomes overly thick.</li>

<li>Be sure to taste to make sure gravy is sufficiently seasoned.</li>

<li>Serve the meat next to a big side of mashed potatoes.</li>

<li>Pour gravy over the whole shebang!</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org06fb909" class="outline-2">
<h2 id="org06fb909">Deep Dish Pizza Recipe</h2>
<div class="outline-text-2" id="text-org06fb909">
</div>
<div id="outline-container-orgfc225fd" class="outline-3">
<h3 id="orgfc225fd">Link:</h3>
<div class="outline-text-3" id="text-orgfc225fd">
<ul class="org-ul">
<li>The 4 keys to make perfect CHICAGO DEEP DISH pizza every time (<a href="https://www.youtube.com/watch?v=89RYM6k0tKA">https://www.youtube.com/watch?v=89RYM6k0tKA</a>)</li>
</ul>
</div>
</div>
<div id="outline-container-org7063ee0" class="outline-3">
<h3 id="org7063ee0">Dough Ingredients:</h3>
<div class="outline-text-3" id="text-org7063ee0">
<ul class="org-ul">
<li>450g or about 3 1/4 cup flour</li>
<li>40g or 1/4 cup cornmeal</li>
<li>12g or 3 tsp sugar  15g or 3 tsp salt</li>
<li>275g or 1 1/4 cup water (85F)</li>
<li>110g or 8 tbsp (1 stick) butter cubed</li>
<li>9g or 3 tsp yeast</li>
</ul>
</div>
</div>
<div id="outline-container-orgc446be8" class="outline-3">
<h3 id="orgc446be8">Sauce Ingredients:</h3>
<div class="outline-text-3" id="text-orgc446be8">
<ul class="org-ul">
<li>1 28oz can nice crushed tomato</li>
<li>1/4 red onion (grated)</li>
<li>2 garlic cloves ( run through press or minced)</li>
<li>40g or 2 tbps tomato paste</li>
<li>10g or 1 tbps sugar</li>
<li>1g or 1/2 tsp dried basil</li>
<li>1g or 1/2 tsp dried oregano</li>
<li>2-3 tbps butter</li>
<li>5g salt or 1 tsp</li>
</ul>
</div>
</div>
<div id="outline-container-org31fc327" class="outline-3">
<h3 id="org31fc327">Sausage Ingredients:</h3>
<div class="outline-text-3" id="text-org31fc327">
<ul class="org-ul">
<li>1 lb fatty ground pork</li>
<li>7g or 1.5 tsp salt</li>
<li>5g or 1 tsp sugar</li>
<li>3g or 1 tsp paprika</li>
<li>1g or 1/2 tsp dried sage</li>
<li>1g or 1/2 tsp black pepper</li>
<li>5g or 1.5 tsp red wine vinegar</li>
<li>1g or 1/2 tsp chile flake</li>
<li>1g or 1/2 tsp garlic powder</li>
<li>2g or 1 tsp toasted crushed fennel seed</li>
</ul>
</div>
</div>
<div id="outline-container-orgbd9653d" class="outline-3">
<h3 id="orgbd9653d">Directions To Prepare Sauce:</h3>
<div class="outline-text-3" id="text-orgbd9653d">
<ol class="org-ol">
<li>In a medium saute or sauce pan, preheat over medium heat, melt butter.</li>

<li>Add in onion and garlic and 5g salt, then sweat until translucent and starting to take on color.</li>

<li>Add in tomato paste and fry until rusty color emerges (30-40 seconds).</li>

<li>Add in crushed tomatoes, sugar, dried herbs and cook on low heat for 20 minutes stir often, cool for later pizza building.</li>
</ol>
</div>
</div>
<div id="outline-container-org55a3074" class="outline-3">
<h3 id="org55a3074">Directions To Prepare Sausage:</h3>
<div class="outline-text-3" id="text-org55a3074">
<ol class="org-ol">
<li>Fold ingredients to combine, cook a little off to taste for seasoning.</li>
</ol>
</div>
</div>
<div id="outline-container-org93fcd43" class="outline-3">
<h3 id="org93fcd43">Directions To Prepare Entire Pizza:</h3>
<div class="outline-text-3" id="text-org93fcd43">
<ol class="org-ol">
<li>Combine dry ingredients in food processor, add in cubed butter and run food processor until incorporated and pebble-like.</li>

<li>While running, stream in warm water until combines, run for 30-40 seconds total.</li>

<li>Transfer to bowl and let rise for 90 minutes.</li>

<li>Divide into 2 equal pieces and shape into loose rounds, move to oiled sheet tray and cover with another sheet tray.</li>

<li>Let rise 1 hour.</li>

<li>Then roll into 12" round, oil a 9"-10 cast iron (LINK BELOW) or cake pan with 3 TBPS olive oil.</li>

<li>Lay in rolled out dough and then build pizza: CHEESE + SAUSAGE + SAUCE + PARM CHILE FLAKE .</li>

<li>Bake 30-40 minutes in 425 oven until crust is fried and golden.</li>

<li>Let cool 10 minutes then serve.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org3211ed7" class="outline-2">
<h2 id="org3211ed7">Gluten Free Bread Recipe</h2>
<div class="outline-text-2" id="text-org3211ed7">
</div>
<div id="outline-container-org82821aa" class="outline-3">
<h3 id="org82821aa">Link:</h3>
<div class="outline-text-3" id="text-org82821aa">
<ul class="org-ul">
<li><a href="https://www.goodforyouglutenfree.com/gluten-free-sandwich-bread/">https://www.goodforyouglutenfree.com/gluten-free-sandwich-bread/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org54591bc" class="outline-3">
<h3 id="org54591bc">Ingredients:</h3>
<div class="outline-text-3" id="text-org54591bc">
<ul class="org-ul">
<li>3 cups Bob’s Red Mill 1-to-1 Gluten-Free Flour blend 430 grams</li>
<li>2 Tbsp light brown sugar</li>
<li>2 tsp instant yeast equivalent to one packet</li>
<li>2 tsp Kosher salt</li>
<li>1 cup warm milk or milk substitute</li>
<li>1 Tbsp raw honey</li>
<li>4 Tbsp soft butter or butter substitute</li>
<li>3 large eggs</li>
</ul>
</div>
</div>
<div id="outline-container-org7bdd4e5" class="outline-3">
<h3 id="org7bdd4e5">Directions:</h3>
<div class="outline-text-3" id="text-org7bdd4e5">
<ol class="org-ol">
<li>Combine flour, brown sugar, yeast, salt in the bowl of your standing mixer.</li>

<li>Attach the paddle attachment to your standing mixer and slowly mix all ingredients on low speed.</li>

<li>Drizzle in milk, then add honey and butter and continue to mix well.</li>

<li>Turn mixer to medium speed and add each egg, one at a time until incorporated.</li>

<li>Once all the eggs are added, mix dough for 1 minute until all ingredients are well combined.</li>

<li>The batter will be sticky and soft (not like normal bread dough).</li>

<li>Grease an 8.5 x 4.5" loaf pan and gently pour dough into the pan without deflating it.</li>

<li>Cover with plastic wrap and place in warm spot to rise for 90-120 minutes.</li>

<li>Preheat oven to 350º F and bake for 38-40 minutes until the top is slightly browned and the dough is cooked through.</li>

<li>Place bread on a wire rack to cool completely.</li>

<li>Use a serrated bread knife to cut bread into slices.</li>

<li>The bread tastes fantastic toasted and lasts for several days when wrapped in plastic wrap.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org699ca4f" class="outline-2">
<h2 id="org699ca4f">Gnocchi Recipe From Gennaro Contaldo</h2>
<div class="outline-text-2" id="text-org699ca4f">
</div>
<div id="outline-container-org0ac4ef2" class="outline-3">
<h3 id="org0ac4ef2">Links:</h3>
<div class="outline-text-3" id="text-org0ac4ef2">
</div>
<div id="outline-container-orge56ad42" class="outline-4">
<h4 id="orge56ad42">Recipe Link:</h4>
<div class="outline-text-4" id="text-orge56ad42">
<ul class="org-ul">
<li><a href="https://www.yellowmellowlife.com/gennaro-contaldos-gnocchi/">https://www.yellowmellowlife.com/gennaro-contaldos-gnocchi/</a></li>
</ul>
</div>
</div>
