maindishrecipes.org
*** YouTube Video Links:
- Simple Gnocchi Recipe (Video in which Genarro goes over how to make Gnocci in an easier all-in-one video):
+ https://www.youtube.com/watch?v=FveqjpehElM

Jamie Oliver's YouTube Videos Featuring Gennaro Making Gnocchi:
- Gennaro makes Gnocchi (Part 1):
+ https://www.youtube.com/watch?v=LRmPcaGAG0s&t=18s

- Amazing Gnocchi Al Forno with Gennaro Contaldo Video (Part 2):
+ https://www.youtube.com/watch?v=GqxE5hBe7LA&t=49s
** Ingredients:
*** Gnocci Ingredients:
- 2 pounds potatoes (roughly 1 kg)
- 2 egg yolks
- 1 cup all-purpose flour
- Leaves from few sprigs of coriander – chopped
- Salt and pepper to taste
- Rice flour to dust (all-purpose flour can also be used)
*** Sage Butter Sauce Ingredients:
- Quarterstick of butter
- Handful of sage
- 1/2 cup / 100 grams Fontina cheese
- Parmesean cheese to grate ontop of finished Gnocchi
** Directions:
1. The first thing is to boil potatoes. It helps if your potatoes are roughly of the same size. That way they all take the same time to cook.

2. Otherwise, potatoes can also be baked.

3. The only thing to keep in mind is that we want the potatoes to get cooked, but not overcook.

4. If you are boiling them, make sure you take them out well on time or else I have noticed water seeping into potatoes making them a little soggy.

5. Boil or bake, what we are looking for is a cooked potato, whose skin you can peel easily with hand.

6. And when you cut it in two pieces, it should feel fluffy.

7. The method that Gennaro recommends (and which I use) is putting raw potatoes in a pot full of cold water.

8. Then, I let the water come to a boil.

9. After that boil them for additional 20 minutes.

10. If not, keep going for another 10 minutes.

11. I use the toothpick check to check my potatoes: Insert the toothpick in the potatoes – if it goes in and comes out easily, they are done.

12. After the potatoes are boiled, peeled them at your own convenience. However, let them come at room temperature before you go to the next step.

13. Now we need to mash the potatoes You can crumble them using your hands. Many people use potato ricer, you can even use a fork. I use a grater.

14. Make sure that the grated/ mashed potato remains flaky and retains its shape. Try not to handle it too much.

15. Now sprinkle a nice amount of rice flour on your work surface.

16. Put your grated potatoes in the shape of a well. Add in chopped coriander leaves and salt and pepper to taste.

17. Now dust the all purpose flour on your well. Inside the well, dump the 2 egg yolks.

18. Now start kneading. Remember not to apply a lot of pressure to your dough. Instead work with light hands and just try to bring everything together.

19. Feel free to add in a little more all purpose flour if you require. But just don’t go overboard with it.

20. The secret of good gnocchi, according to me, is to have as much as possible of potato and as little as possible of flour. Lot of potato, perfect!

21. Your gnocchi would be soft and light. Lot of flour, not perfect…gnocchi would be thick and heavy.

22. You’ll be left with nice ball of dough in no time.

23. Now take a little portion out of the dough and roll it into a rope, with thickness that of a cigar.

24. Dust the tip of a knife with flour and start cutting in pieces about 1 inch wide. You got your gnocchi.

25. You can get more creative and give each of gnocchi pieces a nice shape. The classic being indentation by a fork.

26. One other famous shape is the pillow shape. Just give a little dig in the middle of your gnocchi.

27. You can make balls or ovals, possibilities are endless. n

28. Keep placing them on a dusted surface.

29. Now if you are making the gnocchi right at this moment, just bring a large pot of water to boil.

30. Add in a little salt and your gnocchi to it. It is a good idea to tilt the pot side to side every once in a while to stop gnocchi from sticking.

31. Let gnocchi simmer in water till it starts floating at the top of the water.

32. At this point, take your gnocchi out using a ladle.

33. Leave it to steam dry for another 2 minutes before using it.

34. Make the sage butter sauce by using a quarterstick of butter in a saute pan, add a handful of sage. then add 1/2 cup of fontina cheese.

35. Add the boiled gnocchi into the pan, and grate parmesean cheese on top.

36. Put the oven's broiler mode on, and then add the pan into the top broiler of the oven for 1 minute or so until the cheese crisps a bit.

37. If you are intending to use your gnocchi later, dust your uncooked gnocchi with a generous amount of flour.

38. Spread it on a plate and keep it in deep freezer till it becomes as hard as stones.

39. After that, just store it in a zip lock and tuck it away in your deep freezer till next time.
* Goulash Recipe
** Link:
- https://www.spendwithpennies.com/hungarian-goulash/
** Ingredients:
- 2 medium onions
- 2 teaspoons butter or lard (preferred)
- 1 teaspoon caraway seeds
- 2 tablespoons paprika
- 1/4 cup flour
- 1 1/2 pound stewing beef trimmed and cut into 1 inch cubes
- 2 cups beef broth or water
- 1 cup diced tomatoes canned
- 1 teaspoon salt
- 1/4 teaspoon pepper
** Optional Ingredients:
- 1 1/2 cup carrots optional
- 3 cups potatoes optional
** Directions:
1. In a large pot, melt butter and add onion.

2. Cook till translucent.

3. Stir in caraway seeds and paprika and mix well.

4. In a bowl, dredge the stew beef with flour.

5. Add beef to the onion mixture and cook for about 2-3 minutes.

6. Slowly add about 1/4 cup of the beef broth to lift the brown bits off the bottom of the pan.

7. Then add remaining broth, diced tomatoes (potatoes and carrots if using), salt and pepper.

8. Stir and bring to a boil, cover, then reduce to a simmer for about 1 1/2 - 2 hours or until tender.
* Hawaiian Chicken Casserole Recipe
** Links:
- https://www.myrecipes.com/recipe/hawaiian-chicken-casserole
- https://www.youtube.com/watch?v=_wZkmBUkdbE
