maindishrecipes.html

<div id="outline-container-org898bee8" class="outline-4">
<h4 id="org898bee8">YouTube Video Links:</h4>
<div class="outline-text-4" id="text-org898bee8">
<ul class="org-ul">
<li>Simple Gnocchi Recipe (Video in which Genarro goes over how to make Gnocci in an easier all-in-one video):</li>
<li><a href="https://www.youtube.com/watch?v=FveqjpehElM">https://www.youtube.com/watch?v=FveqjpehElM</a></li>
</ul>

<p>
Jamie Oliver's YouTube Videos Featuring Gennaro Making Gnocchi:
</p>
<ul class="org-ul">
<li>Gennaro makes Gnocchi (Part 1):</li>
<li><a href="https://www.youtube.com/watch?v=LRmPcaGAG0s&amp;t=18s">https://www.youtube.com/watch?v=LRmPcaGAG0s&amp;t=18s</a></li>

<li>Amazing Gnocchi Al Forno with Gennaro Contaldo Video (Part 2):</li>
<li><a href="https://www.youtube.com/watch?v=GqxE5hBe7LA&amp;t=49s">https://www.youtube.com/watch?v=GqxE5hBe7LA&amp;t=49s</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org744a5e3" class="outline-3">
<h3 id="org744a5e3">Ingredients:</h3>
<div class="outline-text-3" id="text-org744a5e3">
</div>
<div id="outline-container-org00ad666" class="outline-4">
<h4 id="org00ad666">Gnocci Ingredients:</h4>
<div class="outline-text-4" id="text-org00ad666">
<ul class="org-ul">
<li>2 pounds potatoes (roughly 1 kg)</li>
<li>2 egg yolks</li>
<li>1 cup all-purpose flour</li>
<li>Leaves from few sprigs of coriander – chopped</li>
<li>Salt and pepper to taste</li>
<li>Rice flour to dust (all-purpose flour can also be used)</li>
</ul>
</div>
</div>
<div id="outline-container-orgcc37dae" class="outline-4">
<h4 id="orgcc37dae">Sage Butter Sauce Ingredients:</h4>
<div class="outline-text-4" id="text-orgcc37dae">
<ul class="org-ul">
<li>Quarterstick of butter</li>
<li>Handful of sage</li>
<li>1/2 cup / 100 grams Fontina cheese</li>
<li>Parmesean cheese to grate ontop of finished Gnocchi</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org325655a" class="outline-3">
<h3 id="org325655a">Directions:</h3>
<div class="outline-text-3" id="text-org325655a">
<ol class="org-ol">
<li>The first thing is to boil potatoes. It helps if your potatoes are roughly of the same size. That way they all take the same time to cook.</li>

<li>Otherwise, potatoes can also be baked.</li>

<li>The only thing to keep in mind is that we want the potatoes to get cooked, but not overcook.</li>

<li>If you are boiling them, make sure you take them out well on time or else I have noticed water seeping into potatoes making them a little soggy.</li>

<li>Boil or bake, what we are looking for is a cooked potato, whose skin you can peel easily with hand.</li>

<li>And when you cut it in two pieces, it should feel fluffy.</li>

<li>The method that Gennaro recommends (and which I use) is putting raw potatoes in a pot full of cold water.</li>

<li>Then, I let the water come to a boil.</li>

<li>After that boil them for additional 20 minutes.</li>

<li>If not, keep going for another 10 minutes.</li>

<li>I use the toothpick check to check my potatoes: Insert the toothpick in the potatoes – if it goes in and comes out easily, they are done.</li>

<li>After the potatoes are boiled, peeled them at your own convenience. However, let them come at room temperature before you go to the next step.</li>

<li>Now we need to mash the potatoes You can crumble them using your hands. Many people use potato ricer, you can even use a fork. I use a grater.</li>

<li>Make sure that the grated/ mashed potato remains flaky and retains its shape. Try not to handle it too much.</li>

<li>Now sprinkle a nice amount of rice flour on your work surface.</li>

<li>Put your grated potatoes in the shape of a well. Add in chopped coriander leaves and salt and pepper to taste.</li>

<li>Now dust the all purpose flour on your well. Inside the well, dump the 2 egg yolks.</li>

<li>Now start kneading. Remember not to apply a lot of pressure to your dough. Instead work with light hands and just try to bring everything together.</li>

<li>Feel free to add in a little more all purpose flour if you require. But just don’t go overboard with it.</li>

<li>The secret of good gnocchi, according to me, is to have as much as possible of potato and as little as possible of flour. Lot of potato, perfect!</li>

<li>Your gnocchi would be soft and light. Lot of flour, not perfect…gnocchi would be thick and heavy.</li>

<li>You’ll be left with nice ball of dough in no time.</li>

<li>Now take a little portion out of the dough and roll it into a rope, with thickness that of a cigar.</li>

<li>Dust the tip of a knife with flour and start cutting in pieces about 1 inch wide. You got your gnocchi.</li>

<li>You can get more creative and give each of gnocchi pieces a nice shape. The classic being indentation by a fork.</li>

<li>One other famous shape is the pillow shape. Just give a little dig in the middle of your gnocchi.</li>

<li>You can make balls or ovals, possibilities are endless. n</li>

<li>Keep placing them on a dusted surface.</li>

<li>Now if you are making the gnocchi right at this moment, just bring a large pot of water to boil.</li>

<li>Add in a little salt and your gnocchi to it. It is a good idea to tilt the pot side to side every once in a while to stop gnocchi from sticking.</li>

<li>Let gnocchi simmer in water till it starts floating at the top of the water.</li>

<li>At this point, take your gnocchi out using a ladle.</li>

<li>Leave it to steam dry for another 2 minutes before using it.</li>

<li>Make the sage butter sauce by using a quarterstick of butter in a saute pan, add a handful of sage. then add 1/2 cup of fontina cheese.</li>

<li>Add the boiled gnocchi into the pan, and grate parmesean cheese on top.</li>

<li>Put the oven's broiler mode on, and then add the pan into the top broiler of the oven for 1 minute or so until the cheese crisps a bit.</li>

<li>If you are intending to use your gnocchi later, dust your uncooked gnocchi with a generous amount of flour.</li>

<li>Spread it on a plate and keep it in deep freezer till it becomes as hard as stones.</li>

<li>After that, just store it in a zip lock and tuck it away in your deep freezer till next time.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgea5dae9" class="outline-2">
<h2 id="orgea5dae9">Goulash Recipe</h2>
<div class="outline-text-2" id="text-orgea5dae9">
</div>
<div id="outline-container-orgd953119" class="outline-3">
<h3 id="orgd953119">Link:</h3>
<div class="outline-text-3" id="text-orgd953119">
<ul class="org-ul">
<li><a href="https://www.spendwithpennies.com/hungarian-goulash/">https://www.spendwithpennies.com/hungarian-goulash/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9f1eff4" class="outline-3">
<h3 id="org9f1eff4">Ingredients:</h3>
<div class="outline-text-3" id="text-org9f1eff4">
<ul class="org-ul">
<li>2 medium onions</li>
<li>2 teaspoons butter or lard (preferred)</li>
<li>1 teaspoon caraway seeds</li>
<li>2 tablespoons paprika</li>
<li>1/4 cup flour</li>
<li>1 1/2 pound stewing beef trimmed and cut into 1 inch cubes</li>
<li>2 cups beef broth or water</li>
<li>1 cup diced tomatoes canned</li>
<li>1 teaspoon salt</li>
<li>1/4 teaspoon pepper</li>
</ul>
</div>
</div>
<div id="outline-container-org0239e26" class="outline-3">
<h3 id="org0239e26">Optional Ingredients:</h3>
<div class="outline-text-3" id="text-org0239e26">
<ul class="org-ul">
<li>1 1/2 cup carrots optional</li>
<li>3 cups potatoes optional</li>
</ul>
</div>
</div>
<div id="outline-container-org2ee7ef0" class="outline-3">
<h3 id="org2ee7ef0">Directions:</h3>
<div class="outline-text-3" id="text-org2ee7ef0">
<ol class="org-ol">
<li>In a large pot, melt butter and add onion.</li>

<li>Cook till translucent.</li>

<li>Stir in caraway seeds and paprika and mix well.</li>

<li>In a bowl, dredge the stew beef with flour.</li>

<li>Add beef to the onion mixture and cook for about 2-3 minutes.</li>

<li>Slowly add about 1/4 cup of the beef broth to lift the brown bits off the bottom of the pan.</li>

<li>Then add remaining broth, diced tomatoes (potatoes and carrots if using), salt and pepper.</li>

<li>Stir and bring to a boil, cover, then reduce to a simmer for about 1 1/2 - 2 hours or until tender.</li>
</ol>
</div>
</div>
</div>
