maindishrecipes.org
** Ingredients:
- 1 Tbsp. canola oil
- 1 Tbsp. minced fresh ginger
- 1 Tbsp. minced garlic
- 1 jalapeño chile, seeded and chopped
- 3/4 cup sweet onion, diced
- 3/4 tsp. kosher salt
- 2/3 cup light brown sugar
- 1/3 cup soy sauce
- 3 Tbsp. ketchup
- 2 Tbsp. rice vinegar
- 1 1/2 cups diced fresh pineapple
- 1 1/2 cups diced red bell pepper
- 1 1/2 lb. frozen, fully-cooked crispy breaded chicken strips, thawed and cut in 1 1/2-in. pieces
- 1/2 cup sliced fresh scallions
- 3 cups cooked jasmine rice
** Directions:
1. Preheat oven to 375°F.

2. Heat oil in a medium saucepan over medium-high.

3. Add ginger, garlic, and jalapeño; cook, stirring often, until fragrant, about 1 minute.

4. Add onion and salt, and cook, stirring often, until onion begins to soften, about 2 minutes.

5. Add brown sugar, soy sauce, ketchup, and rice vinegar; bring to a simmer, stirring constantly, until sugar is dissolved.

6. Sprinkle pineapple and bell pepper evenly in bottom of a lightly greased 3 quart baking dish.

7. Pour brown sugar-soy mixture over pineapple mixture; top evenly with chicken tenders.

8. Bake in preheated oven until bubbly, and chicken is slightly crisp on top, about 20 minutes.

9. Toss mixture lightly to coat chicken, and sprinkle with scallions.

10. Serve over rice.
* Instant Pot Chicken Taco Bowls
** Link:
- https://wondermomwannabe.com/instant-pot-chicken-taco-bowls/
** Ingredients
- 4 to 5 uncooked boneless, skinless breasts if large, cut in half
- 1 to 2 packets taco seasoning 1 for mild flavor, 2 for more flavor
- 1 15 oz can black beans, drained and rinsed
- 1 12 oz bag frozen corn
- 1 15.5 oz jar salsa
- 3 cups uncooked jasmine rice rinsed
- 3 cups water or chicken broth
- cheddar cheese
- cilantro optional
- sour cream optional
** Directions
1. Add one cup of liquid (water or broth) to the bottom of the pot.
2. Place chicken breasts in bottom of pressure cooker on top of the liquid.
3. Sprinkle with taco seasoning.
4. Top with beans and corn.
5. Then, pour salsa over everything.
6. Add rice, then remaining liquid (water or broth).
7. Cook on manual high pressure for 12 minutes.
8. Then, use quick release to release the pressure.
9. Once the pressure has been fully released, remove lid carefully.
10. Shred chicken.
11. Serve immediately.
12. Top with cheddar cheese, cilantro, and sour cream as desired.
* Instant Pot Mac And Cheese Recipe
** Links:
- https://www.myrecipes.com/recipe/instant-pot-mac-and-cheese-with-bacon
- https://www.youtube.com/watch?v=kOAXRpKHdTY&t=1295s
** Ingredients:
- 4 strips bacon, chopped
- 1 pound uncooked medium pasta shells
- 4 cups water
- 2 tablespoons unsalted butter
- 2 teaspoons salt
- 1 (5-ounce) can evaporated milk
- 8 ounces cheddar cheese, shredded
- 8 ounces Gouda, shredded
- black pepper to taste
** Directions:
1. In a 6-quart Instant Pot® add chopped bacon and press [Sauté].

2. Cook bacon for 8 minutes or until crispy.

3. Remove bacon with a slotted spoon and set aside.

4. Turn Instant Pot off by hitting [Cancel].

5. Add the pasta, water, butter, and salt.

6. Close and lock the lid of the Instant Pot® and press [Manual], select high pressure and use [Adjust] to select "Less" mode.

7. Press [-] or [+] to choose 4 minutes cook time.

8. Carefully turn knob to vent position to release steam.

9. Remove lid.

10. Stir in the evaporated milk, cheddar cheese, Gouda cheese and black pepper.

11. Press [Sauté] and cook for about 4 minutes or until the cheese had melted, stirring frequently.

12. Stir in bacon and serve warm.
* Italian Style Green Bean Casserole Recipe
** Links:
- https://www.myrecipes.com/recipe/Italian-style-green-bean-casserole
- https://www.youtube.com/watch?v=_wZkmBUkdbE
** Ingredients:
- 6 ounces Parmesan cheese, grated (about 1 1/2 cups), divided
- 1 1/4 cups Italian-style breadcrumbs, divided
- 4 garlic cloves, minced
- 1 teaspoon kosher salt
- 3/4 teaspoon black pepper, divided
- 3 (28-oz.) cans Italian-style green beans, drained
- 2 (9-oz.) pkg. frozen artichoke hearts, thawed, drained well and chopped
- 2/3 extra-virgin olive oil
- Fresh flat-leaf parsley, chopped
** Directions:
1. Preheat oven to 375°F.

2. Combine Parmesan, breadcrumbs, garlic, salt, and 1/2 teaspoon pepper in a large bowl.

3. Reserve 1/3 cup of the breadcrumb mixture; set aside.

4. Add green beans, artichoke hearts, and olive oil to bowl with remaining breadcrumb mixture, and fold to combine well.

5. Pour green bean mixture into a lightly greased 13- x 9-inch baking dish.

6. Sprinkle reserved breadcrumb mixture evenly over casserole.

7. Cover with aluminum foil, and bake until heated through, about 30 minutes.

8. Uncover and bake until lightly golden and bubbly, about 10 minutes.

9. Sprinkle with remaining 1/4 teaspoon pepper, and if desired, chopped parsley.
* Kale Pie Recipe
** Link:
- https://ingmar.app/blog/kale-pie-with-walnuts-and-blue-cheese/
* Langos Recipe
** Link:
- https://honestcooking.com/hungarian-langos/
** Ingredients:
- 300 g all-purpose flour (1.27 cups)
- 7 g dried (instant) yeast (1.40 teaspoons)
- 250 ml water (1.05 cups)
- 1/2 teaspoon salt
- sunflower oil for frying
- toppings: sour cream, grated cheese, garlic
