maindishrecipes.html
<div id="outline-container-orga4a28f7" class="outline-2">
<h2 id="orga4a28f7">Hawaiian Chicken Casserole Recipe</h2>
<div class="outline-text-2" id="text-orga4a28f7">
</div>
<div id="outline-container-org64b837f" class="outline-3">
<h3 id="org64b837f">Links:</h3>
<div class="outline-text-3" id="text-org64b837f">
<ul class="org-ul">
<li><a href="https://www.myrecipes.com/recipe/hawaiian-chicken-casserole">https://www.myrecipes.com/recipe/hawaiian-chicken-casserole</a></li>
<li><a href="https://www.youtube.com/watch?v=_wZkmBUkdbE">https://www.youtube.com/watch?v=_wZkmBUkdbE</a></li>
</ul>
</div>
</div>
<div id="outline-container-org12b18b6" class="outline-3">
<h3 id="org12b18b6">Ingredients:</h3>
<div class="outline-text-3" id="text-org12b18b6">
<ul class="org-ul">
<li>1 Tbsp. canola oil</li>
<li>1 Tbsp. minced fresh ginger</li>
<li>1 Tbsp. minced garlic</li>
<li>1 jalapeño chile, seeded and chopped</li>
<li>3/4 cup sweet onion, diced</li>
<li>3/4 tsp. kosher salt</li>
<li>2/3 cup light brown sugar</li>
<li>1/3 cup soy sauce</li>
<li>3 Tbsp. ketchup</li>
<li>2 Tbsp. rice vinegar</li>
<li>1 1/2 cups diced fresh pineapple</li>
<li>1 1/2 cups diced red bell pepper</li>
<li>1 1/2 lb. frozen, fully-cooked crispy breaded chicken strips, thawed and cut in 1 1/2-in. pieces</li>
<li>1/2 cup sliced fresh scallions</li>
<li>3 cups cooked jasmine rice</li>
</ul>
</div>
</div>
<div id="outline-container-org056c93f" class="outline-3">
<h3 id="org056c93f">Directions:</h3>
<div class="outline-text-3" id="text-org056c93f">
<ol class="org-ol">
<li>Preheat oven to 375°F.</li>

<li>Heat oil in a medium saucepan over medium-high.</li>

<li>Add ginger, garlic, and jalapeño; cook, stirring often, until fragrant, about 1 minute.</li>

<li>Add onion and salt, and cook, stirring often, until onion begins to soften, about 2 minutes.</li>

<li>Add brown sugar, soy sauce, ketchup, and rice vinegar; bring to a simmer, stirring constantly, until sugar is dissolved.</li>

<li>Sprinkle pineapple and bell pepper evenly in bottom of a lightly greased 3 quart baking dish.</li>

<li>Pour brown sugar-soy mixture over pineapple mixture; top evenly with chicken tenders.</li>

<li>Bake in preheated oven until bubbly, and chicken is slightly crisp on top, about 20 minutes.</li>

<li>Toss mixture lightly to coat chicken, and sprinkle with scallions.</li>

<li>Serve over rice.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org21b54bd" class="outline-2">
<h2 id="org21b54bd">Instant Pot Chicken Taco Bowls</h2>
<div class="outline-text-2" id="text-org21b54bd">
</div>
<div id="outline-container-orgaa12b51" class="outline-3">
<h3 id="orgaa12b51">Link:</h3>
<div class="outline-text-3" id="text-orgaa12b51">
<ul class="org-ul">
<li><a href="https://wondermomwannabe.com/instant-pot-chicken-taco-bowls/">https://wondermomwannabe.com/instant-pot-chicken-taco-bowls/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org724c1e5" class="outline-3">
<h3 id="org724c1e5">Ingredients</h3>
<div class="outline-text-3" id="text-org724c1e5">
<ul class="org-ul">
<li>4 to 5 uncooked boneless, skinless breasts if large, cut in half</li>
<li>1 to 2 packets taco seasoning 1 for mild flavor, 2 for more flavor</li>
<li>1 15 oz can black beans, drained and rinsed</li>
<li>1 12 oz bag frozen corn</li>
<li>1 15.5 oz jar salsa</li>
<li>3 cups uncooked jasmine rice rinsed</li>
<li>3 cups water or chicken broth</li>
<li>cheddar cheese</li>
<li>cilantro optional</li>
<li>sour cream optional</li>
</ul>
</div>
</div>
<div id="outline-container-org00ab1b0" class="outline-3">
<h3 id="org00ab1b0">Directions</h3>
<div class="outline-text-3" id="text-org00ab1b0">
<ol class="org-ol">
<li>Add one cup of liquid (water or broth) to the bottom of the pot.</li>
<li>Place chicken breasts in bottom of pressure cooker on top of the liquid.</li>
<li>Sprinkle with taco seasoning.</li>
<li>Top with beans and corn.</li>
<li>Then, pour salsa over everything.</li>
<li>Add rice, then remaining liquid (water or broth).</li>
<li>Cook on manual high pressure for 12 minutes.</li>
<li>Then, use quick release to release the pressure.</li>
<li>Once the pressure has been fully released, remove lid carefully.</li>
<li>Shred chicken.</li>
<li>Serve immediately.</li>
<li>Top with cheddar cheese, cilantro, and sour cream as desired.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgfd80c85" class="outline-2">
<h2 id="orgfd80c85">Instant Pot Mac And Cheese Recipe</h2>
<div class="outline-text-2" id="text-orgfd80c85">
</div>
<div id="outline-container-org12bcc03" class="outline-3">
<h3 id="org12bcc03">Links:</h3>
<div class="outline-text-3" id="text-org12bcc03">
<ul class="org-ul">
<li><a href="https://www.myrecipes.com/recipe/instant-pot-mac-and-cheese-with-bacon">https://www.myrecipes.com/recipe/instant-pot-mac-and-cheese-with-bacon</a></li>
<li><a href="https://www.youtube.com/watch?v=kOAXRpKHdTY&amp;t=1295s">https://www.youtube.com/watch?v=kOAXRpKHdTY&amp;t=1295s</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1ccde64" class="outline-3">
<h3 id="org1ccde64">Ingredients:</h3>
<div class="outline-text-3" id="text-org1ccde64">
<ul class="org-ul">
<li>4 strips bacon, chopped</li>
<li>1 pound uncooked medium pasta shells</li>
<li>4 cups water</li>
<li>2 tablespoons unsalted butter</li>
<li>2 teaspoons salt</li>
<li>1 (5-ounce) can evaporated milk</li>
<li>8 ounces cheddar cheese, shredded</li>
<li>8 ounces Gouda, shredded</li>
<li>black pepper to taste</li>
</ul>
</div>
</div>
<div id="outline-container-org2142d6b" class="outline-3">
<h3 id="org2142d6b">Directions:</h3>
<div class="outline-text-3" id="text-org2142d6b">
<ol class="org-ol">
<li>In a 6-quart Instant Pot® add chopped bacon and press [Sauté].</li>

<li>Cook bacon for 8 minutes or until crispy.</li>

<li>Remove bacon with a slotted spoon and set aside.</li>

<li>Turn Instant Pot off by hitting [Cancel].</li>

<li>Add the pasta, water, butter, and salt.</li>

<li>Close and lock the lid of the Instant Pot® and press [Manual], select high pressure and use [Adjust] to select "Less" mode.</li>

<li>Press [-] or [+] to choose 4 minutes cook time.</li>

<li>Carefully turn knob to vent position to release steam.</li>

<li>Remove lid.</li>

<li>Stir in the evaporated milk, cheddar cheese, Gouda cheese and black pepper.</li>

<li>Press [Sauté] and cook for about 4 minutes or until the cheese had melted, stirring frequently.</li>

<li>Stir in bacon and serve warm.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgbe430d2" class="outline-2">
<h2 id="orgbe430d2">Italian Style Green Bean Casserole Recipe</h2>
<div class="outline-text-2" id="text-orgbe430d2">
</div>
<div id="outline-container-org3fd4424" class="outline-3">
<h3 id="org3fd4424">Links:</h3>
<div class="outline-text-3" id="text-org3fd4424">
<ul class="org-ul">
<li><a href="https://www.myrecipes.com/recipe/Italian-style-green-bean-casserole">https://www.myrecipes.com/recipe/Italian-style-green-bean-casserole</a></li>
<li><a href="https://www.youtube.com/watch?v=_wZkmBUkdbE">https://www.youtube.com/watch?v=_wZkmBUkdbE</a></li>
</ul>
</div>
</div>
<div id="outline-container-org259baf5" class="outline-3">
<h3 id="org259baf5">Ingredients:</h3>
<div class="outline-text-3" id="text-org259baf5">
<ul class="org-ul">
<li>6 ounces Parmesan cheese, grated (about 1 1/2 cups), divided</li>
<li>1 1/4 cups Italian-style breadcrumbs, divided</li>
<li>4 garlic cloves, minced</li>
<li>1 teaspoon kosher salt</li>
<li>3/4 teaspoon black pepper, divided</li>
<li>3 (28-oz.) cans Italian-style green beans, drained</li>
<li>2 (9-oz.) pkg. frozen artichoke hearts, thawed, drained well and chopped</li>
<li>2/3 extra-virgin olive oil</li>
<li>Fresh flat-leaf parsley, chopped</li>
</ul>
</div>
</div>
<div id="outline-container-org9e304d3" class="outline-3">
<h3 id="org9e304d3">Directions:</h3>
<div class="outline-text-3" id="text-org9e304d3">
<ol class="org-ol">
<li>Preheat oven to 375°F.</li>

<li>Combine Parmesan, breadcrumbs, garlic, salt, and 1/2 teaspoon pepper in a large bowl.</li>

<li>Reserve 1/3 cup of the breadcrumb mixture; set aside.</li>

<li>Add green beans, artichoke hearts, and olive oil to bowl with remaining breadcrumb mixture, and fold to combine well.</li>

<li>Pour green bean mixture into a lightly greased 13- x 9-inch baking dish.</li>

<li>Sprinkle reserved breadcrumb mixture evenly over casserole.</li>

<li>Cover with aluminum foil, and bake until heated through, about 30 minutes.</li>

<li>Uncover and bake until lightly golden and bubbly, about 10 minutes.</li>

<li>Sprinkle with remaining 1/4 teaspoon pepper, and if desired, chopped parsley.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org5fbcf03" class="outline-2">
<h2 id="org5fbcf03">Kale Pie Recipe</h2>
<div class="outline-text-2" id="text-org5fbcf03">
</div>
<div id="outline-container-orgbaa96de" class="outline-3">
<h3 id="orgbaa96de">Link:</h3>
<div class="outline-text-3" id="text-orgbaa96de">
<ul class="org-ul">
<li><a href="https://ingmar.app/blog/kale-pie-with-walnuts-and-blue-cheese/">https://ingmar.app/blog/kale-pie-with-walnuts-and-blue-cheese/</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org92b7b31" class="outline-2">
<h2 id="org92b7b31">Langos Recipe</h2>
<div class="outline-text-2" id="text-org92b7b31">
</div>
<div id="outline-container-org26d08a4" class="outline-3">
<h3 id="org26d08a4">Link:</h3>
<div class="outline-text-3" id="text-org26d08a4">
<ul class="org-ul">
<li><a href="https://honestcooking.com/hungarian-langos/">https://honestcooking.com/hungarian-langos/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8eba237" class="outline-3">
<h3 id="org8eba237">Ingredients:</h3>
<div class="outline-text-3" id="text-org8eba237">
<ul class="org-ul">
<li>300 g all-purpose flour (1.27 cups)</li>
<li>7 g dried (instant) yeast (1.40 teaspoons)</li>
<li>250 ml water (1.05 cups)</li>
<li>1/2 teaspoon salt</li>
<li>sunflower oil for frying</li>
<li>toppings: sour cream, grated cheese, garlic</li>
</ul>
</div>
</div>
