maindishrecipes.org
** Directions:
1. In a mug dissolve the salt in the water.

2. In a bowl combine the sifted flour with the yeast.

3. Add salty water to it and stir through (if it’s very sticky, add a little bit more flour).

4. Work the dough with a wooden spoon or with your hands until the dough comes off the bowl and gets smooth.

5. Leave the dough in the bowl, cover with a clean cloth and let it rise for 30-40 minutes or until it has doubled in bulk.

6. Once it is rested, carefully tip out the dough onto a floured surface, stretch out into a square and cut out about 10 cm (3,93 inch) round shapes with a big glass (big cookie cutter also good).

7. Stretch out each piece with your fingers into a round shape with the centre being thinner than the edges.

8. Let the pieces rest for another 30 minutes on the floured surface.

9. In a saucepan heat sunflower oil.

10. Place lángos into the hot oil, fry it on one side until golden brown then turn.

11. Repeat with the remaining lángos dough.

12. Serve while it’s hot.

13. You can eat it simple or sprinkle with chopped garlic or douse with garlic water and top with grated cheese and sour cream.
* Overnight Oats Recipe
** Link:
- https://lemonsandzest.com/stumbling-blocks-stepping-stones-recipe-peanut-butter-cup-overnight-oats/
** Ingredients:
- 1/2 cup rolled oats regular or gluten free
- 2 to 3 tsp peanut butter or any nut or seed butter
- 1 tsp cocoa powder
- 1 tsp vanilla
- 2 tsp pure maple syrup or honey
- 1/2 cup milk of choice
- Dash of sea salt
- 1 tsp chia seeds optional
** Directions:
1. Combine all ingredients in small jar or bowl that can be sealed.

2. Stir well and then cover.

3. Refrigerate overnight.

4. Serving options: serve with a sprinkle of cocoa nibs, extra peanut butter drizzle, dark chocolate chips, or sliced banana.
* Meatball Stroganoff Recipe (One-Pot)
** Link:
- https://www.pillsbury.com/recipes/one-pot-meatball-stroganoff-for-two/3a2b6bb9-fb65-4f09-8ba5-211ef587d272
** Ingredients:
- 2 tablespoons butter
- 4 oz sliced baby bella mushrooms (about 1 1/3 cups)
- 1/8 teaspoon salt
- 1/8 teaspoon pepper
- 2 cups Progresso™ beef flavored broth (from 32-oz carton)
- 2 cups uncooked wide egg noodles (from 12-oz bag)
- 12 frozen fully cooked beef meatballs, thawed (from 22-oz bag)
- 1/3 cup sour cream
** Directions:
1. In 2-quart saucepan, heat butter over medium-high heat.

2. Add mushrooms, salt and pepper; cook 3 to 5 minutes, stirring frequently, until tender.

2. Add beef broth, egg noodles and meatballs; heat to boiling.

3. Reduce heat to medium; simmer uncovered 9 to 11 minutes, stirring occasionally, until liquid is mostly absorbed.

4. Remove from heat; let stand 5 minutes.

5. Stir in sour cream; serve immediately.
* Nokedli Recipe
** Link:
- https://dailynewshungary.com/traditional-hungarian-nokedli-dumpling-recipe-as-we-inherited-it-from-our-grandmothers/
** Ingredients (converted from metric to imperial units)
- 2 cups flour
- 4 eggs
- 0.84535057 cup water (less than a cup, 200 mL water originally)
- pinch of salt
** Directions:
1. Mixing the dough: After the ingredients are prepared, you can start mixing the dough.

2. First, pour the flour, the eggs and the salt into a bowl.

3. If you do not add enough eggs, the dough will be too sticky.

3. Start combining the first two ingredients and add water gradually.

4. The secret of good dumplings is that you should not overmix the dough or leave it to rest because it can harden.

5. Put a bigger pot of water to boil (add some salt and oil to the water) before you start mixing the ingredients.

6. Forming the dumplings: You can use a dumpling maker/grater, a teaspoon or a knife to form the dumplings.

7. In the first case, place the grater on top of the pot, fill the sliding basket with the dough and slide it back and forth.

8. I would recommend using a spoon because it allows you to form even and perfectly-shaped ‘nokedli’.

9. Stir the dumplings occasionally, so they do not stick to the bottom of the pot.

10. Cooking the dumplings: You have to keep it in mind that dumplings do not take much time to cook, so try forming them as quickly as you can.

11. The dumplings are ready when they float to the surface of the water.

12. Rinsing and seasoning: After you drain the cooked dumplings, you can rinse them with water so they do not stick together.

13. However, this step is a bit controversial since it cools the dish.

14. Another solution is to add a bit of oil, fat or butter to the dumplings.

15. You can season the dumplings with some chives or garlic and it is the perfect side dish for chicken paprikash.
* Philly Mac And Cheese Steak Casserole Recipe
** Links:
- https://www.myrecipes.com/recipe/philly-mac-and-cheese-steak
- https://www.youtube.com/watch?v=_wZkmBUkdbE
** Ingredients:
- 4 teaspoons olive oil, divided
- 1 cup sliced mushrooms
- 1 cup thinly sliced onion (from 1 onion)
- 3/4 cup sliced red bell pepper (from 1 pepper)
- 3/4 cup sliced green bell pepper (from 1 pepper)
- 1 teaspoon garlic powder
- 3/4 teaspoon kosher salt
- 1/2 teaspoon black pepper
- 4 tablespoons unsalted butter
- 4 tablespoons all-purpose flour
- 2 1/2 cups whole milk
- 2 teaspoons Worcestershire sauce
- 1/2 teaspoon dry mustard
- 4 ounces processed cheese (such as Velveeta)
- 8 ounces cavatappi or elbow pasta, prepared according to package directions
- 12 ounces chopped deli roast beef
- 8 ounces sharp provolone cheese, shredded (about 2 cups), divided
- 1/3 cup panko (Japanese-style bread crumbs)
- Chopped fresh flat-leaf parsley (optional)
