maindishrecipes.html
<div id="outline-container-org280dfd2" class="outline-3">
<h3 id="org280dfd2">Directions:</h3>
<div class="outline-text-3" id="text-org280dfd2">
<ol class="org-ol">
<li>In a mug dissolve the salt in the water.</li>

<li>In a bowl combine the sifted flour with the yeast.</li>

<li>Add salty water to it and stir through (if it’s very sticky, add a little bit more flour).</li>

<li>Work the dough with a wooden spoon or with your hands until the dough comes off the bowl and gets smooth.</li>

<li>Leave the dough in the bowl, cover with a clean cloth and let it rise for 30-40 minutes or until it has doubled in bulk.</li>

<li>Once it is rested, carefully tip out the dough onto a floured surface, stretch out into a square and cut out about 10 cm (3,93 inch) round shapes with a big glass (big cookie cutter also good).</li>

<li>Stretch out each piece with your fingers into a round shape with the centre being thinner than the edges.</li>

<li>Let the pieces rest for another 30 minutes on the floured surface.</li>

<li>In a saucepan heat sunflower oil.</li>

<li>Place lángos into the hot oil, fry it on one side until golden brown then turn.</li>

<li>Repeat with the remaining lángos dough.</li>

<li>Serve while it’s hot.</li>

<li>You can eat it simple or sprinkle with chopped garlic or douse with garlic water and top with grated cheese and sour cream.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org5ecb488" class="outline-2">
<h2 id="org5ecb488">Overnight Oats Recipe</h2>
<div class="outline-text-2" id="text-org5ecb488">
</div>
<div id="outline-container-orgb558b9d" class="outline-3">
<h3 id="orgb558b9d">Link:</h3>
<div class="outline-text-3" id="text-orgb558b9d">
<ul class="org-ul">
<li><a href="https://lemonsandzest.com/stumbling-blocks-stepping-stones-recipe-peanut-butter-cup-overnight-oats/">https://lemonsandzest.com/stumbling-blocks-stepping-stones-recipe-peanut-butter-cup-overnight-oats/</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc0785fa" class="outline-3">
<h3 id="orgc0785fa">Ingredients:</h3>
<div class="outline-text-3" id="text-orgc0785fa">
<ul class="org-ul">
<li>1/2 cup rolled oats regular or gluten free</li>
<li>2 to 3 tsp peanut butter or any nut or seed butter</li>
<li>1 tsp cocoa powder</li>
<li>1 tsp vanilla</li>
<li>2 tsp pure maple syrup or honey</li>
<li>1/2 cup milk of choice</li>
<li>Dash of sea salt</li>
<li>1 tsp chia seeds optional</li>
</ul>
</div>
</div>
<div id="outline-container-orgbdda298" class="outline-3">
<h3 id="orgbdda298">Directions:</h3>
<div class="outline-text-3" id="text-orgbdda298">
<ol class="org-ol">
<li>Combine all ingredients in small jar or bowl that can be sealed.</li>

<li>Stir well and then cover.</li>

<li>Refrigerate overnight.</li>

<li>Serving options: serve with a sprinkle of cocoa nibs, extra peanut butter drizzle, dark chocolate chips, or sliced banana.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org2bee52e" class="outline-2">
<h2 id="org2bee52e">Meatball Stroganoff Recipe (One-Pot)</h2>
<div class="outline-text-2" id="text-org2bee52e">
</div>
<div id="outline-container-orgfe81c10" class="outline-3">
<h3 id="orgfe81c10">Link:</h3>
<div class="outline-text-3" id="text-orgfe81c10">
<ul class="org-ul">
<li><a href="https://www.pillsbury.com/recipes/one-pot-meatball-stroganoff-for-two/3a2b6bb9-fb65-4f09-8ba5-211ef587d272">https://www.pillsbury.com/recipes/one-pot-meatball-stroganoff-for-two/3a2b6bb9-fb65-4f09-8ba5-211ef587d272</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge15830a" class="outline-3">
<h3 id="orge15830a">Ingredients:</h3>
<div class="outline-text-3" id="text-orge15830a">
<ul class="org-ul">
<li>2 tablespoons butter</li>
<li>4 oz sliced baby bella mushrooms (about 1 1/3 cups)</li>
<li>1/8 teaspoon salt</li>
<li>1/8 teaspoon pepper</li>
<li>2 cups Progresso™ beef flavored broth (from 32-oz carton)</li>
<li>2 cups uncooked wide egg noodles (from 12-oz bag)</li>
<li>12 frozen fully cooked beef meatballs, thawed (from 22-oz bag)</li>
<li>1/3 cup sour cream</li>
</ul>
</div>
</div>
<div id="outline-container-org5261075" class="outline-3">
<h3 id="org5261075">Directions:</h3>
<div class="outline-text-3" id="text-org5261075">
<ol class="org-ol">
<li>In 2-quart saucepan, heat butter over medium-high heat.</li>

<li>Add mushrooms, salt and pepper; cook 3 to 5 minutes, stirring frequently, until tender.</li>

<li>Add beef broth, egg noodles and meatballs; heat to boiling.</li>

<li>Reduce heat to medium; simmer uncovered 9 to 11 minutes, stirring occasionally, until liquid is mostly absorbed.</li>

<li>Remove from heat; let stand 5 minutes.</li>

<li>Stir in sour cream; serve immediately.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org71fcfb0" class="outline-2">
<h2 id="org71fcfb0">Nokedli Recipe</h2>
<div class="outline-text-2" id="text-org71fcfb0">
</div>
<div id="outline-container-orgcb455ad" class="outline-3">
<h3 id="orgcb455ad">Link:</h3>
<div class="outline-text-3" id="text-orgcb455ad">
<ul class="org-ul">
<li><a href="https://dailynewshungary.com/traditional-hungarian-nokedli-dumpling-recipe-as-we-inherited-it-from-our-grandmothers/">https://dailynewshungary.com/traditional-hungarian-nokedli-dumpling-recipe-as-we-inherited-it-from-our-grandmothers/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org709e2e3" class="outline-3">
<h3 id="org709e2e3">Ingredients (converted from metric to imperial units)</h3>
<div class="outline-text-3" id="text-org709e2e3">
<ul class="org-ul">
<li>2 cups flour</li>
<li>4 eggs</li>
<li>0.84535057 cup water (less than a cup, 200 mL water originally)</li>
<li>pinch of salt</li>
</ul>
</div>
</div>
<div id="outline-container-org9001f5f" class="outline-3">
<h3 id="org9001f5f">Directions:</h3>
<div class="outline-text-3" id="text-org9001f5f">
<ol class="org-ol">
<li>Mixing the dough: After the ingredients are prepared, you can start mixing the dough.</li>

<li>First, pour the flour, the eggs and the salt into a bowl.</li>

<li>If you do not add enough eggs, the dough will be too sticky.</li>

<li>Start combining the first two ingredients and add water gradually.</li>

<li>The secret of good dumplings is that you should not overmix the dough or leave it to rest because it can harden.</li>

<li>Put a bigger pot of water to boil (add some salt and oil to the water) before you start mixing the ingredients.</li>

<li>Forming the dumplings: You can use a dumpling maker/grater, a teaspoon or a knife to form the dumplings.</li>

<li>In the first case, place the grater on top of the pot, fill the sliding basket with the dough and slide it back and forth.</li>

<li>I would recommend using a spoon because it allows you to form even and perfectly-shaped ‘nokedli’.</li>

<li>Stir the dumplings occasionally, so they do not stick to the bottom of the pot.</li>

<li>Cooking the dumplings: You have to keep it in mind that dumplings do not take much time to cook, so try forming them as quickly as you can.</li>

<li>The dumplings are ready when they float to the surface of the water.</li>

<li>Rinsing and seasoning: After you drain the cooked dumplings, you can rinse them with water so they do not stick together.</li>

<li>However, this step is a bit controversial since it cools the dish.</li>

<li>Another solution is to add a bit of oil, fat or butter to the dumplings.</li>

<li>You can season the dumplings with some chives or garlic and it is the perfect side dish for chicken paprikash.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org064fbf7" class="outline-2">
<h2 id="org064fbf7">Philly Mac And Cheese Steak Casserole Recipe</h2>
<div class="outline-text-2" id="text-org064fbf7">
</div>
<div id="outline-container-org58604bc" class="outline-3">
<h3 id="org58604bc">Links:</h3>
<div class="outline-text-3" id="text-org58604bc">
<ul class="org-ul">
<li><a href="https://www.myrecipes.com/recipe/philly-mac-and-cheese-steak">https://www.myrecipes.com/recipe/philly-mac-and-cheese-steak</a></li>
<li><a href="https://www.youtube.com/watch?v=_wZkmBUkdbE">https://www.youtube.com/watch?v=_wZkmBUkdbE</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1635251" class="outline-3">
<h3 id="org1635251">Ingredients:</h3>
<div class="outline-text-3" id="text-org1635251">
<ul class="org-ul">
<li>4 teaspoons olive oil, divided</li>
<li>1 cup sliced mushrooms</li>
<li>1 cup thinly sliced onion (from 1 onion)</li>
<li>3/4 cup sliced red bell pepper (from 1 pepper)</li>
<li>3/4 cup sliced green bell pepper (from 1 pepper)</li>
<li>1 teaspoon garlic powder</li>
<li>3/4 teaspoon kosher salt</li>
<li>1/2 teaspoon black pepper</li>
<li>4 tablespoons unsalted butter</li>
<li>4 tablespoons all-purpose flour</li>
<li>2 1/2 cups whole milk</li>
<li>2 teaspoons Worcestershire sauce</li>
<li>1/2 teaspoon dry mustard</li>
<li>4 ounces processed cheese (such as Velveeta)</li>
<li>8 ounces cavatappi or elbow pasta, prepared according to package directions</li>
<li>12 ounces chopped deli roast beef</li>
<li>8 ounces sharp provolone cheese, shredded (about 2 cups), divided</li>
<li>1/3 cup panko (Japanese-style bread crumbs)</li>
<li>Chopped fresh flat-leaf parsley (optional)</li>
</ul>
</div>
</div>
