maindishrecipes.org
** Directions:
1. Preheat oven to 375°F.

2. Heat 1 tablespoon of the oil in a large skillet over medium-high.

3. Add mushrooms, onion, and bell peppers; cook, stirring constantly, until veggies begin to soften, about 3 minutes.

4. Add garlic powder, salt, and pepper; cook, stirring often, 2 minutes.

5. Add butter to veggie mixture; cook until butter is melted.

6. Sprinkle in flour; cook, stirring constantly, 1 to 2 minutes.

7. Whisk in milk, Worcestershire, and dry mustard until smooth.

8. Reduce heat to medium-low, and stir in Velveeta until smooth.

9. Remove from heat, and stir in cooked pasta, roast beef, and 1 1/4 cups provolone until combined.

10. Pour mixture into an 11- x 7-inch baking dish lightly coated with cooking spray; top with remaining 3/4 cup cheese.

11. Stir together panko and remaining 1 teaspoon oil in a small bowl.

12. Sprinkle breadcrumb mixture evenly over pasta mixture, and bake in preheated oven until golden and bubbly, 20 to 25 minutes.

13. Sprinkle with parsley, if desired.
* Pho Recipe
** Link:
- https://www.vice.com/en_us/article/yw75w7/homemade-pho-recipe?
** Ingredients:
*** Broth
- 7 pounds beef bones with marrow (can do oxtail)
- 1 pound beef brisket
- 3 pounds chuck short rib
- 1/4 cup fish sauce
- 6-8 shallots
- 2 large hands ginger
- 2 large white onions, halved
- 1 tablespoon coriander seed
- 1 tablespoon fennel seed
- 10 whole fructus amomi
- 5 whole star anise
- 6 whole cloves
- 3 cinnamon sticks
- 1 whole green cardamom pod
*** For Serving
- 1 pound, 450 grams pho rice noodles
- 1/2 pound eye of round, sirloin, flank, London broil, sliced very thinly
- 1 bunch scallions, sliced into small rings
- 1 medium onion, sliced thinly
- 3-4 cups bean sprouts
- 1 bunch cilantro
- 1 bunch Thai basil
- Lime wedges
- hoisin sauce
- Sriracha sauce
** Directions:
1. Place the beef bones into a stockpot of 10 to 12-quart capacity.

2. Fill the pot with enough water to just cover all the bones, leaving at least 1 inch at the top to allow room for boiling.

3. Heat the pot on high until the water boils and let it continue to boil aggressively for 5 minutes to release impurities from the sides of the bones.

4. Once clean, turn off the heat. Pour the contents of the pot into a colander or directly into a clean sink that is lined with a strainer to catch solids.

5. Rinse the bones until they are clean of blood and impurities. Be careful not to lose any marrow in the process.

6. Char the onion, ginger, and shallots either by holding them with metal tongs over an open flame or setting them directly on an electric burner.

7. Alternatively, you can put them under a broiler.

8. Remove once they take on some color and char, but before they become burned.

9. Make sure the onion and shallots are at the very top of the stockpot during the simmering time so that you can remove them if they begin to disintegrate into the stock.

10. In a small dry pan, toast the spices on low heat for a few minutes, or until they begin to release their aroma.

11. Add the toasted spices into the fine mesh bag or cheesecloth and tie shut with string.

12. Put the parboiled and/or roasted bones into a clean stockpot.

13. Add the chuck for flavor, brisket, oxtail, or short ribs you plan to serve.

14. Add the charred onion, ginger, shallots, and toasted spices.

15. Fill the pot with water, or until all the ingredients are covered.

16. Turn the heat on high, but keep a close eye on the pot to prevent the water from reaching a full boil.

17. Just before the water reaches boiling (small bubbles will begin to rise), turn the heat to the lowest setting to maintain a very low simmer.

18. If you’re not already using the smallest burner on your stovetop, then move the pot there now to keep the heat at a minimum.

19. You want as little movement in the water as possible.

20. Keep the broth at a very low simmer for 6 to 8 hours, skimming regularly for any scum and impurities that rise to the surface.

21. If you are not using a mesh bag or cheesecloth to hold the onion and garlic, check to make sure that they don’t start to disintegrate and cloud the stock after several hours if so, go ahead and remove them.

22. For the eye of round, which will be served rare, put the whole raw piece of meat in the freezer for about 30 minutes to let it harden a bit. This makes it easier to slice thinly.

23. Then take the meat out and slice across the grain as thinly as possible.

24. Refrigerate the sliced meat until the pho is ready to serve.

25. If cooking flank, brisket, or oxtail, check the softness of these meats after 2 to 3 hours of simmering in the stock (depending on how large the pieces of oxtail, that cut may take longer).

26. When tender, take these meats out (but make sure to leave the chuck in) and let them rest for at least 15 minutes.

27. Slice the flank and brisket across the grain. Leave small pieces of oxtail as is or, if large, they can also be roughly shredded with a fork.

28. Let the meat cool, then refrigerate until ready to serve.

29. After the stock has simmered 6-8 hours, remove all of the stock ingredients (bones, meat, aromatics, and spices).

30. Strain the broth with a cheesecloth to filter out everything.

31. Season the broth with the rock sugar and fish sauce, starting in small increments and tasting as you go.

32. The broth should end up on the saltier side and will balance out when served with the noodles and other ingredients.

33. I usually end up with about 4 quarts of broth after simmering and find that the listed amount of salt and fish sauce is about what’s needed for my tastes.

34. But every pot of broth turns out differently depending on many factors, and you may end up with more or less liquid after simmering, so season incrementally and according to your tastes.

35. You can also add more sugar if you like your pho on the sweeter side.

36. After seasoning, the broth can be either served right away or allowed to cool at room temperature.

37. If serving right away, the fat can be skimmed off with a spoon (though a little bit of fat lends flavor!).

38. Always cook the noodles in a separate pot of water, never in the stock itself.

39. If cooking the noodles beforehand (that is, before your broth is ready), always undercook them slightly since they will need to be reheated before serving.

40. If using dried noodles, first soak them in hot water for 30 minutes.

41. Then, add the soaked noodles to a pot of boiling water and cook for about 20 seconds.

42. Drain and rinse under cold water.

43. If using fresh noodles, loosen them first under cold water before adding them into a pot of boiling water.

44. Cook for about 20 seconds or until just al dente.

45. Drain and rinse under cold water.

46. To reheat just before serving, place individual portions of noodles in a sieve and submerge the sieve into boiling water for a few seconds, just until the noodles come loose.

47. Serve with all the fixings for people to build their own bowls.
* Pogacsa Recipe
