maindishrecipes.html
<div id="outline-container-orge123f26" class="outline-3">
<h3 id="orge123f26">Directions:</h3>
<div class="outline-text-3" id="text-orge123f26">
<ol class="org-ol">
<li>Preheat oven to 375°F.</li>

<li>Heat 1 tablespoon of the oil in a large skillet over medium-high.</li>

<li>Add mushrooms, onion, and bell peppers; cook, stirring constantly, until veggies begin to soften, about 3 minutes.</li>

<li>Add garlic powder, salt, and pepper; cook, stirring often, 2 minutes.</li>

<li>Add butter to veggie mixture; cook until butter is melted.</li>

<li>Sprinkle in flour; cook, stirring constantly, 1 to 2 minutes.</li>

<li>Whisk in milk, Worcestershire, and dry mustard until smooth.</li>

<li>Reduce heat to medium-low, and stir in Velveeta until smooth.</li>

<li>Remove from heat, and stir in cooked pasta, roast beef, and 1 1/4 cups provolone until combined.</li>

<li>Pour mixture into an 11- x 7-inch baking dish lightly coated with cooking spray; top with remaining 3/4 cup cheese.</li>

<li>Stir together panko and remaining 1 teaspoon oil in a small bowl.</li>

<li>Sprinkle breadcrumb mixture evenly over pasta mixture, and bake in preheated oven until golden and bubbly, 20 to 25 minutes.</li>

<li>Sprinkle with parsley, if desired.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org48eddf4" class="outline-2">
<h2 id="org48eddf4">Pho Recipe</h2>
<div class="outline-text-2" id="text-org48eddf4">
</div>
<div id="outline-container-orgea80bdd" class="outline-3">
<h3 id="orgea80bdd">Link:</h3>
<div class="outline-text-3" id="text-orgea80bdd">
<ul class="org-ul">
<li><a href="https://www.vice.com/en_us/article/yw75w7/homemade-pho-recipe">https://www.vice.com/en_us/article/yw75w7/homemade-pho-recipe</a>?</li>
</ul>
</div>
</div>
<div id="outline-container-org4572e20" class="outline-3">
<h3 id="org4572e20">Ingredients:</h3>
<div class="outline-text-3" id="text-org4572e20">
</div>
<div id="outline-container-orgeb1cf90" class="outline-4">
<h4 id="orgeb1cf90">Broth</h4>
<div class="outline-text-4" id="text-orgeb1cf90">
<ul class="org-ul">
<li>7 pounds beef bones with marrow (can do oxtail)</li>
<li>1 pound beef brisket</li>
<li>3 pounds chuck short rib</li>
<li>1/4 cup fish sauce</li>
<li>6-8 shallots</li>
<li>2 large hands ginger</li>
<li>2 large white onions, halved</li>
<li>1 tablespoon coriander seed</li>
<li>1 tablespoon fennel seed</li>
<li>10 whole fructus amomi</li>
<li>5 whole star anise</li>
<li>6 whole cloves</li>
<li>3 cinnamon sticks</li>
<li>1 whole green cardamom pod</li>
</ul>
</div>
</div>
<div id="outline-container-orgdd98932" class="outline-4">
<h4 id="orgdd98932">For Serving</h4>
<div class="outline-text-4" id="text-orgdd98932">
<ul class="org-ul">
<li>1 pound, 450 grams pho rice noodles</li>
<li>1/2 pound eye of round, sirloin, flank, London broil, sliced very thinly</li>
<li>1 bunch scallions, sliced into small rings</li>
<li>1 medium onion, sliced thinly</li>
<li>3-4 cups bean sprouts</li>
<li>1 bunch cilantro</li>
<li>1 bunch Thai basil</li>
<li>Lime wedges</li>
<li>hoisin sauce</li>
<li>Sriracha sauce</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgfa53284" class="outline-3">
<h3 id="orgfa53284">Directions:</h3>
<div class="outline-text-3" id="text-orgfa53284">
<ol class="org-ol">
<li>Place the beef bones into a stockpot of 10 to 12-quart capacity.</li>

<li>Fill the pot with enough water to just cover all the bones, leaving at least 1 inch at the top to allow room for boiling.</li>

<li>Heat the pot on high until the water boils and let it continue to boil aggressively for 5 minutes to release impurities from the sides of the bones.</li>

<li>Once clean, turn off the heat. Pour the contents of the pot into a colander or directly into a clean sink that is lined with a strainer to catch solids.</li>

<li>Rinse the bones until they are clean of blood and impurities. Be careful not to lose any marrow in the process.</li>

<li>Char the onion, ginger, and shallots either by holding them with metal tongs over an open flame or setting them directly on an electric burner.</li>

<li>Alternatively, you can put them under a broiler.</li>

<li>Remove once they take on some color and char, but before they become burned.</li>

<li>Make sure the onion and shallots are at the very top of the stockpot during the simmering time so that you can remove them if they begin to disintegrate into the stock.</li>

<li>In a small dry pan, toast the spices on low heat for a few minutes, or until they begin to release their aroma.</li>

<li>Add the toasted spices into the fine mesh bag or cheesecloth and tie shut with string.</li>

<li>Put the parboiled and/or roasted bones into a clean stockpot.</li>

<li>Add the chuck for flavor, brisket, oxtail, or short ribs you plan to serve.</li>

<li>Add the charred onion, ginger, shallots, and toasted spices.</li>

<li>Fill the pot with water, or until all the ingredients are covered.</li>

<li>Turn the heat on high, but keep a close eye on the pot to prevent the water from reaching a full boil.</li>

<li>Just before the water reaches boiling (small bubbles will begin to rise), turn the heat to the lowest setting to maintain a very low simmer.</li>

<li>If you’re not already using the smallest burner on your stovetop, then move the pot there now to keep the heat at a minimum.</li>

<li>You want as little movement in the water as possible.</li>

<li>Keep the broth at a very low simmer for 6 to 8 hours, skimming regularly for any scum and impurities that rise to the surface.</li>

<li>If you are not using a mesh bag or cheesecloth to hold the onion and garlic, check to make sure that they don’t start to disintegrate and cloud the stock after several hours if so, go ahead and remove them.</li>

<li>For the eye of round, which will be served rare, put the whole raw piece of meat in the freezer for about 30 minutes to let it harden a bit. This makes it easier to slice thinly.</li>

<li>Then take the meat out and slice across the grain as thinly as possible.</li>

<li>Refrigerate the sliced meat until the pho is ready to serve.</li>

<li>If cooking flank, brisket, or oxtail, check the softness of these meats after 2 to 3 hours of simmering in the stock (depending on how large the pieces of oxtail, that cut may take longer).</li>

<li>When tender, take these meats out (but make sure to leave the chuck in) and let them rest for at least 15 minutes.</li>

<li>Slice the flank and brisket across the grain. Leave small pieces of oxtail as is or, if large, they can also be roughly shredded with a fork.</li>

<li>Let the meat cool, then refrigerate until ready to serve.</li>

<li>After the stock has simmered 6-8 hours, remove all of the stock ingredients (bones, meat, aromatics, and spices).</li>

<li>Strain the broth with a cheesecloth to filter out everything.</li>

<li>Season the broth with the rock sugar and fish sauce, starting in small increments and tasting as you go.</li>

<li>The broth should end up on the saltier side and will balance out when served with the noodles and other ingredients.</li>

<li>I usually end up with about 4 quarts of broth after simmering and find that the listed amount of salt and fish sauce is about what’s needed for my tastes.</li>

<li>But every pot of broth turns out differently depending on many factors, and you may end up with more or less liquid after simmering, so season incrementally and according to your tastes.</li>

<li>You can also add more sugar if you like your pho on the sweeter side.</li>

<li>After seasoning, the broth can be either served right away or allowed to cool at room temperature.</li>

<li>If serving right away, the fat can be skimmed off with a spoon (though a little bit of fat lends flavor!).</li>

<li>Always cook the noodles in a separate pot of water, never in the stock itself.</li>

<li>If cooking the noodles beforehand (that is, before your broth is ready), always undercook them slightly since they will need to be reheated before serving.</li>

<li>If using dried noodles, first soak them in hot water for 30 minutes.</li>

<li>Then, add the soaked noodles to a pot of boiling water and cook for about 20 seconds.</li>

<li>Drain and rinse under cold water.</li>

<li>If using fresh noodles, loosen them first under cold water before adding them into a pot of boiling water.</li>

<li>Cook for about 20 seconds or until just al dente.</li>

<li>Drain and rinse under cold water.</li>

<li>To reheat just before serving, place individual portions of noodles in a sieve and submerge the sieve into boiling water for a few seconds, just until the noodles come loose.</li>

<li>Serve with all the fixings for people to build their own bowls.</li>
</ol>
</div>
</div>
</div>
