maindishrecipes.org
** Link:
- https://www.food.com/recipe/pogacsa-hungarian-cheese-biscuits-510722
** Ingredients:
- 1/2 cup whole milk, heated to 110 degrees F to 115 degrees F
- 2 teaspoons active dry yeast
- 1/2 teaspoon sugar
- 4 cups all-purpose flour
- 5 ounces gruyere cheese, finely shredded
- 1 tablespoon salt
- 2 eggs
- 14 tablespoons unsalted butter, softened (1 3/4 American sticks)
- 1/2 cup sour cream
** Topping Ingredients:
- 1 egg yolk
- 2 ounces gruyere cheese, finely shredded
** Directions:
1. In a large bowl, combine milk, yeast and sugar and let stand until yeast is softened, about 10 minutes.

2. Add flour, cheese, salt, eggs, butter, and sour cream to the yeast mixture.

3. Using an electric mixer, mix on low speed until dough comes together.

4. Beat on medium speed 1 to 2 minutes. The dough should be smooth and not sticky.

5. Roll dough 1/2 inch thick on a lightly floured surface.

6. Make a shallow cross-hatched pattern with the point of a sharp knife over the top of the dough and brush with egg yolk.

7. Sprinkle cheese on top, and cut out rounds with a 1 to 1 1/2 inch cutter.

8. Arrange circles in rows on a parchment-lined baking sheet, about 1/4 inch apart.

9. Put pan in a cold oven and set temperature to 400 degrees F.

10. Bake about 25 minutes, until pogacsa are nicely browned on their tops and bottoms.

11. Let cool completely and store airtight.

12. Pogacsa may also be frozen up to 1 month.

13. Thaw and reheat at 225 degrees F for 20 minutes.
* Porkolt Recipe
** Link:
- https://www.allrecipes.com/recipe/190100/porkolt-hungarian-stew-made-with-pork/
** Ingredients:
- 5 slices bacon, diced
- 2 large onions, diced
- 1/4 cup Hungarian paprika
- 1 1/2 teaspoons garlic powder
- 1/4 teaspoon ground black pepper
- 5 pounds boneless pork chops, trimmed
- 1 large yellow bell pepper, seeded and diced
- 2 (14 ounce) cans diced tomatoes, with liquid
- 2/3 cup beef broth
- 2 cups reduced-fat sour cream
- 2 (6 ounce) packages wide egg noodles
** Directions:
1. Place the bacon in a large, deep skillet, and cook over medium-high heat until evenly browned, about 10 minutes.

2. Drain, and reserve the drippings.

3. Add the onions to the bacon and cook together until the onion is translucent.

4. Remove skillet from heat and stir the paprika, garlic powder, and pepper into the bacon mixture.

5. Transfer the mixture into a large stockpot.

6. Heat a small amount of the reserved bacon drippings in the skillet again over medium-high heat.

7. Cook the pork chops in batches in the hot drippings until evenly browned on both sides.

8. Use additional bacon drippings for each batch as needed.

9. Remove the pork chops to a cutting board and blot excess fat off the surface of the chops with a paper towel.

10. Cut into bite-sized cubes and stir into the bacon mixture.

11. Heat a small amount of the bacon drippings in the skillet.

12. Cook and stir the bell pepper in the hot drippings until softened and fragrant.

13. Drain on a plate lined with paper towels.

14. Stir the cooked pepper into the bacon mixture.

15. Pour the tomatoes with liquid and beef broth into a stockpot and place the pot over medium-high heat.

16. Bring to a simmer and reduce heat to medium-low.

17. Cook until the stew begins to thicken, stirring occasionally, about 90 minutes.

18. Stir the sour cream into the stew just before serving.

19. Bring a pot with lightly-salted water and bring to a rolling boil.

20. Add the egg noodles to the water and return to a boil.

21. Cook uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 5 minutes.

22. Drain well in a colander set in the sink.

23. Ladle the stew over the drained noodles to serve.

* Rakott Krumpli (Hungarian Layered Potatoes) Recipe
** Link:
- https://www.youtube.com/watch?v=S_vlBM95g1A&t=175s
** Ingredients (Serves 6):
- 4 lbs (about 2kg) potatoes (use waxy or all-purpose type, which retain their shape)
- 8 eggs
- 3 oz (80-100g gr) smoked bacon
- 1 lb (450gr) Smoked Hungarian Sausage (or Chorizo)
- 1.1 lbs (500 gr) full fat sour cream
- 1 tsp Paprika
- 1 tbsp Vegeta (all purpose seasoning) – optional
- Salt
** Directions:
1. In a large pot boil the potatoes with skin on until almost done.

2. Be careful, do not overcook! It's better if slightly under-cooked (as they will cook in the oven too).

3. Make 8 hard boiled eggs.

4. Cut the smoked bacon into small cubes, then cook them until golden (half-done).

5. Cut the sausage (not too thin) slices.

6. When the potatoes are ready, drain them and let them cool a little.

7. Peel and slice the eggs.

8. Peel the boiled potatoes while they're still warm (almost hot, if you can handle them).

9. Not too thinly slice all the potatoes, or, you can slice them directly into the tray when layering the dish.

10. Mix the sour cream with 1 tbsp of Vegeta (all-purpose seasoning). It's optional, you can use the sour cream without it. (I like it, because it gives a nice, salty flavor).

11. Preheat the oven to 350F (180 C).

12. Grease the baking tray with the fat from the bacon.

13. Place one layer of the sliced potatoes, then sprinkle with salt. The second layer is the sliced sausage, then one layer of sliced eggs.

14. Cover it with the (seasoned) sour cream.

15. Repeat this one more time: potatoes, (salt), sausages, eggs, sour cream.

16. Finish it with a layer of potatoes, covered with sour cream.

17. Sprinkle the bacon pieces on top (you can add some bacon pieces between the layers too!), and also sprinkle some paprika on top.

18. Bake in the preheated oven for 40-45 minutes (until the top is nicely browned, the sausages released their fat, and the sour cream is set).

19. Let it stay and cool about 10-15 minutes, then serve.

20. You can add some extra sour cream on top, and serve some pickles on side.
* Sausage Gravy Breakfast Pizza
** Link:
- https://flavorite.net/sausage-gravy-breakfast-pizza/
** Ingredients:
** Directions:
* Smoked Salmons And Chive Soda Bread
