maindishrecipes.html
<div id="outline-container-orgbcb40fa" class="outline-2">
<h2 id="orgbcb40fa">Pogacsa Recipe</h2>
<div class="outline-text-2" id="text-orgbcb40fa">
</div>
<div id="outline-container-orgc368694" class="outline-3">
<h3 id="orgc368694">Link:</h3>
<div class="outline-text-3" id="text-orgc368694">
<ul class="org-ul">
<li><a href="https://www.food.com/recipe/pogacsa-hungarian-cheese-biscuits-510722">https://www.food.com/recipe/pogacsa-hungarian-cheese-biscuits-510722</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgeef9afb" class="outline-3">
<h3 id="orgeef9afb">Ingredients:</h3>
<div class="outline-text-3" id="text-orgeef9afb">
<ul class="org-ul">
<li>1/2 cup whole milk, heated to 110 degrees F to 115 degrees F</li>
<li>2 teaspoons active dry yeast</li>
<li>1/2 teaspoon sugar</li>
<li>4 cups all-purpose flour</li>
<li>5 ounces gruyere cheese, finely shredded</li>
<li>1 tablespoon salt</li>
<li>2 eggs</li>
<li>14 tablespoons unsalted butter, softened (1 3/4 American sticks)</li>
<li>1/2 cup sour cream</li>
</ul>
</div>
</div>
<div id="outline-container-org1a573f9" class="outline-3">
<h3 id="org1a573f9">Topping Ingredients:</h3>
<div class="outline-text-3" id="text-org1a573f9">
<ul class="org-ul">
<li>1 egg yolk</li>
<li>2 ounces gruyere cheese, finely shredded</li>
</ul>
</div>
</div>
<div id="outline-container-orgdd3f7b5" class="outline-3">
<h3 id="orgdd3f7b5">Directions:</h3>
<div class="outline-text-3" id="text-orgdd3f7b5">
<ol class="org-ol">
<li>In a large bowl, combine milk, yeast and sugar and let stand until yeast is softened, about 10 minutes.</li>

<li>Add flour, cheese, salt, eggs, butter, and sour cream to the yeast mixture.</li>

<li>Using an electric mixer, mix on low speed until dough comes together.</li>

<li>Beat on medium speed 1 to 2 minutes. The dough should be smooth and not sticky.</li>

<li>Roll dough 1/2 inch thick on a lightly floured surface.</li>

<li>Make a shallow cross-hatched pattern with the point of a sharp knife over the top of the dough and brush with egg yolk.</li>

<li>Sprinkle cheese on top, and cut out rounds with a 1 to 1 1/2 inch cutter.</li>

<li>Arrange circles in rows on a parchment-lined baking sheet, about 1/4 inch apart.</li>

<li>Put pan in a cold oven and set temperature to 400 degrees F.</li>

<li>Bake about 25 minutes, until pogacsa are nicely browned on their tops and bottoms.</li>

<li>Let cool completely and store airtight.</li>

<li>Pogacsa may also be frozen up to 1 month.</li>

<li>Thaw and reheat at 225 degrees F for 20 minutes.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org6da24f4" class="outline-2">
<h2 id="org6da24f4">Porkolt Recipe</h2>
<div class="outline-text-2" id="text-org6da24f4">
</div>
<div id="outline-container-orgaadee89" class="outline-3">
<h3 id="orgaadee89">Link:</h3>
<div class="outline-text-3" id="text-orgaadee89">
<ul class="org-ul">
<li><a href="https://www.allrecipes.com/recipe/190100/porkolt-hungarian-stew-made-with-pork/">https://www.allrecipes.com/recipe/190100/porkolt-hungarian-stew-made-with-pork/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5627817" class="outline-3">
<h3 id="org5627817">Ingredients:</h3>
<div class="outline-text-3" id="text-org5627817">
<ul class="org-ul">
<li>5 slices bacon, diced</li>
<li>2 large onions, diced</li>
<li>1/4 cup Hungarian paprika</li>
<li>1 1/2 teaspoons garlic powder</li>
<li>1/4 teaspoon ground black pepper</li>
<li>5 pounds boneless pork chops, trimmed</li>
<li>1 large yellow bell pepper, seeded and diced</li>
<li>2 (14 ounce) cans diced tomatoes, with liquid</li>
<li>2/3 cup beef broth</li>
<li>2 cups reduced-fat sour cream</li>
<li>2 (6 ounce) packages wide egg noodles</li>
</ul>
</div>
</div>
<div id="outline-container-org67db95b" class="outline-3">
<h3 id="org67db95b">Directions:</h3>
<div class="outline-text-3" id="text-org67db95b">
<ol class="org-ol">
<li>Place the bacon in a large, deep skillet, and cook over medium-high heat until evenly browned, about 10 minutes.</li>

<li>Drain, and reserve the drippings.</li>

<li>Add the onions to the bacon and cook together until the onion is translucent.</li>

<li>Remove skillet from heat and stir the paprika, garlic powder, and pepper into the bacon mixture.</li>

<li>Transfer the mixture into a large stockpot.</li>

<li>Heat a small amount of the reserved bacon drippings in the skillet again over medium-high heat.</li>

<li>Cook the pork chops in batches in the hot drippings until evenly browned on both sides.</li>

<li>Use additional bacon drippings for each batch as needed.</li>

<li>Remove the pork chops to a cutting board and blot excess fat off the surface of the chops with a paper towel.</li>

<li>Cut into bite-sized cubes and stir into the bacon mixture.</li>

<li>Heat a small amount of the bacon drippings in the skillet.</li>

<li>Cook and stir the bell pepper in the hot drippings until softened and fragrant.</li>

<li>Drain on a plate lined with paper towels.</li>

<li>Stir the cooked pepper into the bacon mixture.</li>

<li>Pour the tomatoes with liquid and beef broth into a stockpot and place the pot over medium-high heat.</li>

<li>Bring to a simmer and reduce heat to medium-low.</li>

<li>Cook until the stew begins to thicken, stirring occasionally, about 90 minutes.</li>

<li>Stir the sour cream into the stew just before serving.</li>

<li>Bring a pot with lightly-salted water and bring to a rolling boil.</li>

<li>Add the egg noodles to the water and return to a boil.</li>

<li>Cook uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 5 minutes.</li>

<li>Drain well in a colander set in the sink.</li>

<li>Ladle the stew over the drained noodles to serve.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgd3bb337" class="outline-2">
<h2 id="orgd3bb337">Rakott Krumpli (Hungarian Layered Potatoes) Recipe</h2>
<div class="outline-text-2" id="text-orgd3bb337">
</div>
<div id="outline-container-org5d834fb" class="outline-3">
<h3 id="org5d834fb">Link:</h3>
<div class="outline-text-3" id="text-org5d834fb">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=S_vlBM95g1A&amp;t=175s">https://www.youtube.com/watch?v=S_vlBM95g1A&amp;t=175s</a></li>
</ul>
</div>
</div>
<div id="outline-container-org14891bf" class="outline-3">
<h3 id="org14891bf">Ingredients (Serves 6):</h3>
<div class="outline-text-3" id="text-org14891bf">
<ul class="org-ul">
<li>4 lbs (about 2kg) potatoes (use waxy or all-purpose type, which retain their shape)</li>
<li>8 eggs</li>
<li>3 oz (80-100g gr) smoked bacon</li>
<li>1 lb (450gr) Smoked Hungarian Sausage (or Chorizo)</li>
<li>1.1 lbs (500 gr) full fat sour cream</li>
<li>1 tsp Paprika</li>
<li>1 tbsp Vegeta (all purpose seasoning) – optional</li>
<li>Salt</li>
</ul>
</div>
</div>
<div id="outline-container-org97a3bb8" class="outline-3">
<h3 id="org97a3bb8">Directions:</h3>
<div class="outline-text-3" id="text-org97a3bb8">
<ol class="org-ol">
<li>In a large pot boil the potatoes with skin on until almost done.</li>

<li>Be careful, do not overcook! It's better if slightly under-cooked (as they will cook in the oven too).</li>

<li>Make 8 hard boiled eggs.</li>

<li>Cut the smoked bacon into small cubes, then cook them until golden (half-done).</li>

<li>Cut the sausage (not too thin) slices.</li>

<li>When the potatoes are ready, drain them and let them cool a little.</li>

<li>Peel and slice the eggs.</li>

<li>Peel the boiled potatoes while they're still warm (almost hot, if you can handle them).</li>

<li>Not too thinly slice all the potatoes, or, you can slice them directly into the tray when layering the dish.</li>

<li>Mix the sour cream with 1 tbsp of Vegeta (all-purpose seasoning). It's optional, you can use the sour cream without it. (I like it, because it gives a nice, salty flavor).</li>

<li>Preheat the oven to 350F (180 C).</li>

<li>Grease the baking tray with the fat from the bacon.</li>

<li>Place one layer of the sliced potatoes, then sprinkle with salt. The second layer is the sliced sausage, then one layer of sliced eggs.</li>

<li>Cover it with the (seasoned) sour cream.</li>

<li>Repeat this one more time: potatoes, (salt), sausages, eggs, sour cream.</li>

<li>Finish it with a layer of potatoes, covered with sour cream.</li>

<li>Sprinkle the bacon pieces on top (you can add some bacon pieces between the layers too!), and also sprinkle some paprika on top.</li>

<li>Bake in the preheated oven for 40-45 minutes (until the top is nicely browned, the sausages released their fat, and the sour cream is set).</li>

<li>Let it stay and cool about 10-15 minutes, then serve.</li>

<li>You can add some extra sour cream on top, and serve some pickles on side.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org5aff4d6" class="outline-2">
<h2 id="org5aff4d6">Sausage Gravy Breakfast Pizza</h2>
<div class="outline-text-2" id="text-org5aff4d6">
</div>
<div id="outline-container-orged253f4" class="outline-3">
<h3 id="orged253f4">Link:</h3>
<div class="outline-text-3" id="text-orged253f4">
<ul class="org-ul">
<li><a href="https://flavorite.net/sausage-gravy-breakfast-pizza/">https://flavorite.net/sausage-gravy-breakfast-pizza/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org522d3a3" class="outline-3">
<h3 id="org522d3a3">Ingredients:</h3>
</div>
<div id="outline-container-orgcb32eb4" class="outline-3">
<h3 id="orgcb32eb4">Directions:</h3>
</div>
</div>
<div id="outline-container-org85606d5" class="outline-2">
<h2 id="org85606d5">Smoked Salmons And Chive Soda Bread</h2>
<div class="outline-text-2" id="text-org85606d5">
</div>
