maindishrecipes.org
** Link:
- https://thegreatbritishbakeoff.co.uk/recipes/all/hermine-smoked-salmon-and-chive-soda-bread/
** Ingredients:
*** For the bread:
- 200g plain flour
- 2 tbsp plain wholemeal flour
- 2 tbsp spelt flour
- 1/2 tsp baking powder
- 1 tsp bicarbonate of soda
- 1/2 tsp cream of tartar
- 2 tbsp porridge oats
- 3 tsp onion powder
- 30g salted butter, chilled
- 120g smoked salmon, very finely chopped
- 50g gruyère cheese, grated
- 15g chives, finely snipped
- Good pinch of freshly ground black pepper
- 1 large egg
- 160ml buttermilk
- 1 tbsp runny honey
*** For the dill and black garlic butter:
- 300ml double cream
- 1 whole bulb of black garlic, flesh squeezed out
- 30g dill fronds, finely chopped
- pinch of sea salt
- 1 lemon wedge and dill sprig, to decorate
** Directions:
1. Heat the oven to 220°C/200°C fan/Gas 7.

2. Sift the flours, baking powder, bicarbonate and cream of tartar together into a mixing bowl.

3. Stir in the porridge oats and onion powder.

4. Add the butter, rubbing it into the flour until it’s finely distributed.

5. Stir in the salmon, cheese, chives and pepper and toss everything together.

6. Crack the egg into a measuring jug and add enough buttermilk to give 210ml.

7. Add the honey and beat the mixture together with a fork.

8. Stir the wet ingredients into the dry using a round-bladed knife until they come together, then gather the mixture into a ball.

9. Turn out the dough onto a floured work surface, flatten the ball slightly, then place it on a baking sheet.

10. Using a sharp knife, cut a deep cross in the top.

11. Bake for 35–40 minutes, or until golden brown and a skewer inserted into the centre comes out clean.

12. While the bread is baking, make the butter.

13. Place the cream in the bowl of a stand mixer fitted with the whisk attachment.

14. Whisk on a medium speed until the cream curdles, the butter solidifies on the whisk, and the buttermilk separates from the fat.

15. Place the butter inside the muslin-lined sieve over a bowl.

16. Gather up the muslin and squeeze gently to remove the excess buttermilk, then place the butter in a separate bowl.

17. Add the squeezed garlic into the bowl with the butter, along with the chopped dill and pinch of sea salt.

18. Use a hand-held stick blender to blitz until smooth, then spoon into a serving bowl.

19. Garnish with lemon and dill and serve alongside the bread.
* Stuffed Peppers Recipe
** Link:
- https://www.youtube.com/watch?v=_yRH88ooGtg
** Ingredients:
- 7-8 yellow wax pepper
- 1 lb ground pork
- About 1 cup rice
- 1 onion / finely chopped
- 1 egg
- 2 garlic cloves / crushed
- 1 jar (750ml --> 25 oz) thick tomato juice (use Passata if you can find it)
- 3 to 4 tsp tomato paste
- 2 tbsp sugar
- 3 tbsp flour
- 6 tbsp oil
- 4 potatoes (cut into wedges)
- 1 bunch celery leaves (optional)
- Salt, pepper, paprika
** Directions:
1. Heat 2 tbsp oil in a saucepan, add the chopped onion and cook gently until it's soft.

2. Remove from the heat.

3. Cut the stem of the peppers off and deseed them.

4. Place the ground pork in a large bowl, then season with 2 tsp salt, 1 tsp black pepper and 1 heaped tsp paprika.

5. Add the crushed garlic, 1 egg, the pre-washed rice and the softened onion.

6. Using your hands mix everything together, until it's well combined.

7. Fill the peppers with the meat mixture (do not over-stuff them as the rice will expand).

8. If you have meat-mixture left, make some meatballs from it.

9. Heat 4 tbsp oil in a large saucepan, add the flour and cook stirring until it's golden brown.

10. Gently pour the thick tomato juice into the pan, add a little water and mix well.

11. Add 3-4 heaped tsp tomato paste, and season with salt, sugar and black pepper (and also add the celery leaves if you haves some – it's optional).

12. Mix together /it should look like a nice creamy soup.

13. Add the stuffed pepper and meatballs, cover, and cook on low heat at least 1 hour.

14. Check it sometimes, gently stir and turn the peppers over.

15. After 1 hour of cooking the peppers should be soft and the meat cooked through.

16. Meanwhile cook the potato wedges in boiling salted water.

17. When the potato wedges are cooked, drain them in a colander.

17. Now, serve the stuffed peppers and meatballs with the tomato sauce and the boiled potatoes on side.
* Toltott Kaposzta (Hungarian Stuffed Cabbage)
** Link:
- https://www.tasteofhome.com/recipes/hungarian-stuffed-cabbage/
** Ingredients:
- 1 medium head cabbage
- 1 can (28 ounces) sauerkraut, divided
- 1/2 pound ground beef
- 1/2 pound ground pork
- 1/2 cup long grain rice, cooked
- 1 teaspoon salt
- 1/2 teaspoon pepper
- 1 large egg
- 2 bacon strips, diced
- 1 cup chopped onion
- 2 garlic cloves, minced
- 1 tablespoon Hungarian paprika
- 1/4 teaspoon cayenne pepper
- 1 can (14-1/2 ounces) diced tomatoes, undrained
- 1 tablespoon caraway seeds
- 2 cups water
- 2 tablespoons all-purpose flour
- 1 cup sour cream
** Directions:
1. Remove core from head of cabbage.

2. Place in a large saucepan and cover with water.

3. Bring to a boil

4. Boil until outer leaves loosen from head.

5. Lift out cabbage and remove softened leaves.

6. Return to boiling water to soften more leaves.

7. Repeat until all leaves are removed.

8. Remove tough center stalk from each leaf.

9. Set aside 12 large leaves for rolls

10. Set remaining leaves aside.

11. Spoon half of the sauerkraut into a Dutch oven and set aside.

12. In a bowl, combine the beef, pork, rice, salt, pepper and egg.

13. In a saucepan, cook bacon until crisp.

14. Drain on paper towels.

15. In drippings, saute onion and garlic until tender.

16. Add bacon and half of onion mixture to meat mixture and mix well.

17. Preheat oven to 325°.

18. Place about 3 tablespoons filling on each cabbage leaf.

19. Roll up, tucking in sides.

20. Place rolls, seam side down, on sauerkraut in Dutch oven.

21. Coarsely chop reserved cabbage leaves and place over rolls.

22. Add paprika, cayenne, tomatoes, caraway seeds, water and remaining sauerkraut to remaining onion mixture.

23. Cook until heated through, and pour over rolls.

24. Cover and bake for 1 hour 45 minutes.

25. In a small bowl, gradually stir flour into sour cream.

26. Stir in 1 to 2 tablespoons hot cooking liquid and mix well, and spoon over cabbage rolls.

27. Bake, uncovered, until sauce is thickened, 15-20 minutes.
