maindishrecipes.html
<div id="outline-container-org9379082" class="outline-3">
<h3 id="org9379082">Link:</h3>
<div class="outline-text-3" id="text-org9379082">
<ul class="org-ul">
<li><a href="https://thegreatbritishbakeoff.co.uk/recipes/all/hermine-smoked-salmon-and-chive-soda-bread/">https://thegreatbritishbakeoff.co.uk/recipes/all/hermine-smoked-salmon-and-chive-soda-bread/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org836c9e2" class="outline-3">
<h3 id="org836c9e2">Ingredients:</h3>
<div class="outline-text-3" id="text-org836c9e2">
</div>
<div id="outline-container-org83539cf" class="outline-4">
<h4 id="org83539cf">For the bread:</h4>
<div class="outline-text-4" id="text-org83539cf">
<ul class="org-ul">
<li>200g plain flour</li>
<li>2 tbsp plain wholemeal flour</li>
<li>2 tbsp spelt flour</li>
<li>1/2 tsp baking powder</li>
<li>1 tsp bicarbonate of soda</li>
<li>1/2 tsp cream of tartar</li>
<li>2 tbsp porridge oats</li>
<li>3 tsp onion powder</li>
<li>30g salted butter, chilled</li>
<li>120g smoked salmon, very finely chopped</li>
<li>50g gruyère cheese, grated</li>
<li>15g chives, finely snipped</li>
<li>Good pinch of freshly ground black pepper</li>
<li>1 large egg</li>
<li>160ml buttermilk</li>
<li>1 tbsp runny honey</li>
</ul>
</div>
</div>
<div id="outline-container-orgb554659" class="outline-4">
<h4 id="orgb554659">For the dill and black garlic butter:</h4>
<div class="outline-text-4" id="text-orgb554659">
<ul class="org-ul">
<li>300ml double cream</li>
<li>1 whole bulb of black garlic, flesh squeezed out</li>
<li>30g dill fronds, finely chopped</li>
<li>pinch of sea salt</li>
<li>1 lemon wedge and dill sprig, to decorate</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9dcdee5" class="outline-3">
<h3 id="org9dcdee5">Directions:</h3>
<div class="outline-text-3" id="text-org9dcdee5">
<ol class="org-ol">
<li>Heat the oven to 220°C/200°C fan/Gas 7.</li>

<li>Sift the flours, baking powder, bicarbonate and cream of tartar together into a mixing bowl.</li>

<li>Stir in the porridge oats and onion powder.</li>

<li>Add the butter, rubbing it into the flour until it’s finely distributed.</li>

<li>Stir in the salmon, cheese, chives and pepper and toss everything together.</li>

<li>Crack the egg into a measuring jug and add enough buttermilk to give 210ml.</li>

<li>Add the honey and beat the mixture together with a fork.</li>

<li>Stir the wet ingredients into the dry using a round-bladed knife until they come together, then gather the mixture into a ball.</li>

<li>Turn out the dough onto a floured work surface, flatten the ball slightly, then place it on a baking sheet.</li>

<li>Using a sharp knife, cut a deep cross in the top.</li>

<li>Bake for 35–40 minutes, or until golden brown and a skewer inserted into the centre comes out clean.</li>

<li>While the bread is baking, make the butter.</li>

<li>Place the cream in the bowl of a stand mixer fitted with the whisk attachment.</li>

<li>Whisk on a medium speed until the cream curdles, the butter solidifies on the whisk, and the buttermilk separates from the fat.</li>

<li>Place the butter inside the muslin-lined sieve over a bowl.</li>

<li>Gather up the muslin and squeeze gently to remove the excess buttermilk, then place the butter in a separate bowl.</li>

<li>Add the squeezed garlic into the bowl with the butter, along with the chopped dill and pinch of sea salt.</li>

<li>Use a hand-held stick blender to blitz until smooth, then spoon into a serving bowl.</li>

<li>Garnish with lemon and dill and serve alongside the bread.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgedd348f" class="outline-2">
<h2 id="orgedd348f">Stuffed Peppers Recipe</h2>
<div class="outline-text-2" id="text-orgedd348f">
</div>
<div id="outline-container-orgd698816" class="outline-3">
<h3 id="orgd698816">Link:</h3>
<div class="outline-text-3" id="text-orgd698816">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=_yRH88ooGtg">https://www.youtube.com/watch?v=_yRH88ooGtg</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb73a75f" class="outline-3">
<h3 id="orgb73a75f">Ingredients:</h3>
<div class="outline-text-3" id="text-orgb73a75f">
<ul class="org-ul">
<li>7-8 yellow wax pepper</li>
<li>1 lb ground pork</li>
<li>About 1 cup rice</li>
<li>1 onion / finely chopped</li>
<li>1 egg</li>
<li>2 garlic cloves / crushed</li>
<li>1 jar (750ml &#x2013;&gt; 25 oz) thick tomato juice (use Passata if you can find it)</li>
<li>3 to 4 tsp tomato paste</li>
<li>2 tbsp sugar</li>
<li>3 tbsp flour</li>
<li>6 tbsp oil</li>
<li>4 potatoes (cut into wedges)</li>
<li>1 bunch celery leaves (optional)</li>
<li>Salt, pepper, paprika</li>
</ul>
</div>
</div>
<div id="outline-container-org70c365b" class="outline-3">
<h3 id="org70c365b">Directions:</h3>
<div class="outline-text-3" id="text-org70c365b">
<ol class="org-ol">
<li>Heat 2 tbsp oil in a saucepan, add the chopped onion and cook gently until it's soft.</li>

<li>Remove from the heat.</li>

<li>Cut the stem of the peppers off and deseed them.</li>

<li>Place the ground pork in a large bowl, then season with 2 tsp salt, 1 tsp black pepper and 1 heaped tsp paprika.</li>

<li>Add the crushed garlic, 1 egg, the pre-washed rice and the softened onion.</li>

<li>Using your hands mix everything together, until it's well combined.</li>

<li>Fill the peppers with the meat mixture (do not over-stuff them as the rice will expand).</li>

<li>If you have meat-mixture left, make some meatballs from it.</li>

<li>Heat 4 tbsp oil in a large saucepan, add the flour and cook stirring until it's golden brown.</li>

<li>Gently pour the thick tomato juice into the pan, add a little water and mix well.</li>

<li>Add 3-4 heaped tsp tomato paste, and season with salt, sugar and black pepper (and also add the celery leaves if you haves some – it's optional).</li>

<li>Mix together /it should look like a nice creamy soup.</li>

<li>Add the stuffed pepper and meatballs, cover, and cook on low heat at least 1 hour.</li>

<li>Check it sometimes, gently stir and turn the peppers over.</li>

<li>After 1 hour of cooking the peppers should be soft and the meat cooked through.</li>

<li>Meanwhile cook the potato wedges in boiling salted water.</li>

<li>When the potato wedges are cooked, drain them in a colander.</li>

<li>Now, serve the stuffed peppers and meatballs with the tomato sauce and the boiled potatoes on side.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org624a015" class="outline-2">
<h2 id="org624a015">Toltott Kaposzta (Hungarian Stuffed Cabbage)</h2>
<div class="outline-text-2" id="text-org624a015">
</div>
<div id="outline-container-org30f633a" class="outline-3">
<h3 id="org30f633a">Link:</h3>
<div class="outline-text-3" id="text-org30f633a">
<ul class="org-ul">
<li><a href="https://www.tasteofhome.com/recipes/hungarian-stuffed-cabbage/">https://www.tasteofhome.com/recipes/hungarian-stuffed-cabbage/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org960c82c" class="outline-3">
<h3 id="org960c82c">Ingredients:</h3>
<div class="outline-text-3" id="text-org960c82c">
<ul class="org-ul">
<li>1 medium head cabbage</li>
<li>1 can (28 ounces) sauerkraut, divided</li>
<li>1/2 pound ground beef</li>
<li>1/2 pound ground pork</li>
<li>1/2 cup long grain rice, cooked</li>
<li>1 teaspoon salt</li>
<li>1/2 teaspoon pepper</li>
<li>1 large egg</li>
<li>2 bacon strips, diced</li>
<li>1 cup chopped onion</li>
<li>2 garlic cloves, minced</li>
<li>1 tablespoon Hungarian paprika</li>
<li>1/4 teaspoon cayenne pepper</li>
<li>1 can (14-1/2 ounces) diced tomatoes, undrained</li>
<li>1 tablespoon caraway seeds</li>
<li>2 cups water</li>
<li>2 tablespoons all-purpose flour</li>
<li>1 cup sour cream</li>
</ul>
</div>
</div>
<div id="outline-container-org5c78dce" class="outline-3">
<h3 id="org5c78dce">Directions:</h3>
<div class="outline-text-3" id="text-org5c78dce">
<ol class="org-ol">
<li>Remove core from head of cabbage.</li>

<li>Place in a large saucepan and cover with water.</li>

<li>Bring to a boil</li>

<li>Boil until outer leaves loosen from head.</li>

<li>Lift out cabbage and remove softened leaves.</li>

<li>Return to boiling water to soften more leaves.</li>

<li>Repeat until all leaves are removed.</li>

<li>Remove tough center stalk from each leaf.</li>

<li>Set aside 12 large leaves for rolls</li>

<li>Set remaining leaves aside.</li>

<li>Spoon half of the sauerkraut into a Dutch oven and set aside.</li>

<li>In a bowl, combine the beef, pork, rice, salt, pepper and egg.</li>

<li>In a saucepan, cook bacon until crisp.</li>

<li>Drain on paper towels.</li>

<li>In drippings, saute onion and garlic until tender.</li>

<li>Add bacon and half of onion mixture to meat mixture and mix well.</li>

<li>Preheat oven to 325°.</li>

<li>Place about 3 tablespoons filling on each cabbage leaf.</li>

<li>Roll up, tucking in sides.</li>

<li>Place rolls, seam side down, on sauerkraut in Dutch oven.</li>

<li>Coarsely chop reserved cabbage leaves and place over rolls.</li>

<li>Add paprika, cayenne, tomatoes, caraway seeds, water and remaining sauerkraut to remaining onion mixture.</li>

<li>Cook until heated through, and pour over rolls.</li>

<li>Cover and bake for 1 hour 45 minutes.</li>

<li>In a small bowl, gradually stir flour into sour cream.</li>

<li>Stir in 1 to 2 tablespoons hot cooking liquid and mix well, and spoon over cabbage rolls.</li>

<li>Bake, uncovered, until sauce is thickened, 15-20 minutes.</li>
</ol>
</div>
</div>
</div>
