maindishrecipes.org
* Taco Cake Recipe
** Link:
- https://ingmar.app/blog/taco-cake/
* Tiger Bread Recipe
** YouTube Video Link:
- https://www.youtube.com/watch?v=zjMznWyYkpM
** Ingredients:
*** For The Dough
- 500g Strong white bread flour
- 1 Easy bake yeast sachet ((7g))
- 1.5 tsp Unrefined golden caster sugar
- 1.5 tsp Salt
- 1 tbsp Butter (softened )
- 300ml Warm water
*** For the topping
- 3.5g Easy bake yeast
- 0.5 tbsp Unrefined golden caster sugar
- 0.5 tbsp Vegetable oil
- 1 pinch Salt
- 75g Ground rice
- 6 tbsp Warm water
** Directions:
1. MIX: Mix the flour, yeast, sugar and salt in a big bowl.

2. Using your fingertips rub in the butter until only fine ‘crumbs’ are left.

3. Mix in the water with a cutlery knife.

2. KNEAD: Tip onto a lightly flour dusted surface and knead for 10 minutes (or use the dough hook attachment on your mixer).

3. RISE: Lightly grease the mixing bowl with some oil.

4. Put the dough back in, cover the bowl with a clean tea towel and leave to rise until doubled in size.

5. SHAPE: Knock back the dough by gently kneading just 5 times to get the air out.

6. Shape into a smooth oval and sit on a floured baking sheet.

7. PROVE: Cover the dough again with a clean tea towel and leave to prove until doubled in size again.

8. Preheat your oven to 200°C (fan 180°C, gas mark 6).

9. WHISK: Whisk all of the topping ingredients together until smooth.

10. Leave this to rest for 10 minutes.

11. BAKE: Spread the paste all over the top and sides of your loaf – use a palette knife or your hands.

12. Bake for 35 minutes, until it’s golden brown and crackled and when you tap the base it sounds hollow.

13. Cool on a wire rack.
* Turkey Meatloaf Recipe
** Link:
- https://www.allrecipes.com/recipe/231380/best-turkey-meatloaf/
** Ingredients:
*** Meatloaf Ingredients:
- 1  1/2 pounds ground turkey
- 3/4 cup crushed buttery round crackers
- 1/2 cup milk
- 1 small onion, chopped
- 1 egg
- 1  1/2 teaspoons salt
- 2 cloves garlic, minced
- 1/4 teaspoon ground black pepper
*** Topping Ingredients:
- 1/2 cup ketchup
- 1/4 cup brown sugar
- 1 tablespoon Worcestershire sauce
** Directions:
1. Preheat oven to 350 degrees F (175 degrees C).

2. Lightly grease a jelly roll pan.

3. Mix ground turkey, buttery round cracker crumbs, milk, onion, egg, salt, garlic, and black pepper in a bowl

4. Shape into a loaf and place on the prepared jelly roll pan.

5. Mix ketchup, brown sugar, and Worcestershire sauce in a separate bowl and set aside.

6. Bake meatloaf in preheated oven for 30 minutes

7. Remove meatloaf from oven and drain liquids.

8. Top meatloaf with ketchup topping.

9. Return loaf to oven and continue baking until no longer pink in the center, about 30 minutes more.

10. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).
* Zöldbab Krémmel Greenbeans With Cream Recipe
** Link:
- https://www.matildaiscooking.com/recipes/date/2018-04
** Ingredients:
- 1 kg Greenbeans
- 1 Tablespoon of salt
- 2 Tablespoons of Oil
- 1 Tablespoon of butter
- 2 Tablespoons of Flour
- 250ml Fresh Cream
- 1 Tablespoon of Vinegar
** Directions:
1. Watch this video: https://www.youtube.com/watch?v=RrlZqF47W8c&feature=emb_logo

2. Watch Matilda for Directions: Total Cooking Time Approx 35-40 Minutes.

3. Ensure the beans are cooked before mixing together.
