maindishrecipes.html
<div id="outline-container-org052eaea" class="outline-2">
<h2 id="org052eaea">Taco Cake Recipe</h2>
<div class="outline-text-2" id="text-org052eaea">
</div>
<div id="outline-container-org7844d6a" class="outline-3">
<h3 id="org7844d6a">Link:</h3>
<div class="outline-text-3" id="text-org7844d6a">
<ul class="org-ul">
<li><a href="https://ingmar.app/blog/taco-cake/">https://ingmar.app/blog/taco-cake/</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga914005" class="outline-2">
<h2 id="orga914005">Tiger Bread Recipe</h2>
<div class="outline-text-2" id="text-orga914005">
</div>
<div id="outline-container-orgfcc81ff" class="outline-3">
<h3 id="orgfcc81ff">YouTube Video Link:</h3>
<div class="outline-text-3" id="text-orgfcc81ff">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=zjMznWyYkpM">https://www.youtube.com/watch?v=zjMznWyYkpM</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd5df307" class="outline-3">
<h3 id="orgd5df307">Ingredients:</h3>
<div class="outline-text-3" id="text-orgd5df307">
</div>
<div id="outline-container-orgd9563da" class="outline-4">
<h4 id="orgd9563da">For The Dough</h4>
<div class="outline-text-4" id="text-orgd9563da">
<ul class="org-ul">
<li>500g Strong white bread flour</li>
<li>1 Easy bake yeast sachet ((7g))</li>
<li>1.5 tsp Unrefined golden caster sugar</li>
<li>1.5 tsp Salt</li>
<li>1 tbsp Butter (softened )</li>
<li>300ml Warm water</li>
</ul>
</div>
</div>
<div id="outline-container-org03a6667" class="outline-4">
<h4 id="org03a6667">For the topping</h4>
<div class="outline-text-4" id="text-org03a6667">
<ul class="org-ul">
<li>3.5g Easy bake yeast</li>
<li>0.5 tbsp Unrefined golden caster sugar</li>
<li>0.5 tbsp Vegetable oil</li>
<li>1 pinch Salt</li>
<li>75g Ground rice</li>
<li>6 tbsp Warm water</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb298640" class="outline-3">
<h3 id="orgb298640">Directions:</h3>
<div class="outline-text-3" id="text-orgb298640">
<ol class="org-ol">
<li>MIX: Mix the flour, yeast, sugar and salt in a big bowl.</li>

<li>Using your fingertips rub in the butter until only fine ‘crumbs’ are left.</li>

<li>Mix in the water with a cutlery knife.</li>

<li>KNEAD: Tip onto a lightly flour dusted surface and knead for 10 minutes (or use the dough hook attachment on your mixer).</li>

<li>RISE: Lightly grease the mixing bowl with some oil.</li>

<li>Put the dough back in, cover the bowl with a clean tea towel and leave to rise until doubled in size.</li>

<li>SHAPE: Knock back the dough by gently kneading just 5 times to get the air out.</li>

<li>Shape into a smooth oval and sit on a floured baking sheet.</li>

<li>PROVE: Cover the dough again with a clean tea towel and leave to prove until doubled in size again.</li>

<li>Preheat your oven to 200°C (fan 180°C, gas mark 6).</li>

<li>WHISK: Whisk all of the topping ingredients together until smooth.</li>

<li>Leave this to rest for 10 minutes.</li>

<li>BAKE: Spread the paste all over the top and sides of your loaf – use a palette knife or your hands.</li>

<li>Bake for 35 minutes, until it’s golden brown and crackled and when you tap the base it sounds hollow.</li>

<li>Cool on a wire rack.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgfd9b2c3" class="outline-2">
<h2 id="orgfd9b2c3">Turkey Meatloaf Recipe</h2>
<div class="outline-text-2" id="text-orgfd9b2c3">
</div>
<div id="outline-container-orgd206a13" class="outline-3">
<h3 id="orgd206a13">Link:</h3>
<div class="outline-text-3" id="text-orgd206a13">
<ul class="org-ul">
<li><a href="https://www.allrecipes.com/recipe/231380/best-turkey-meatloaf/">https://www.allrecipes.com/recipe/231380/best-turkey-meatloaf/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org58b90c2" class="outline-3">
<h3 id="org58b90c2">Ingredients:</h3>
<div class="outline-text-3" id="text-org58b90c2">
</div>
<div id="outline-container-org9941138" class="outline-4">
<h4 id="org9941138">Meatloaf Ingredients:</h4>
<div class="outline-text-4" id="text-org9941138">
<ul class="org-ul">
<li>1  1/2 pounds ground turkey</li>
<li>3/4 cup crushed buttery round crackers</li>
<li>1/2 cup milk</li>
<li>1 small onion, chopped</li>
<li>1 egg</li>
<li>1  1/2 teaspoons salt</li>
<li>2 cloves garlic, minced</li>
<li>1/4 teaspoon ground black pepper</li>
</ul>
</div>
</div>
<div id="outline-container-orga23ae71" class="outline-4">
<h4 id="orga23ae71">Topping Ingredients:</h4>
<div class="outline-text-4" id="text-orga23ae71">
<ul class="org-ul">
<li>1/2 cup ketchup</li>
<li>1/4 cup brown sugar</li>
<li>1 tablespoon Worcestershire sauce</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb0e9b67" class="outline-3">
<h3 id="orgb0e9b67">Directions:</h3>
<div class="outline-text-3" id="text-orgb0e9b67">
<ol class="org-ol">
<li>Preheat oven to 350 degrees F (175 degrees C).</li>

<li>Lightly grease a jelly roll pan.</li>

<li>Mix ground turkey, buttery round cracker crumbs, milk, onion, egg, salt, garlic, and black pepper in a bowl</li>

<li>Shape into a loaf and place on the prepared jelly roll pan.</li>

<li>Mix ketchup, brown sugar, and Worcestershire sauce in a separate bowl and set aside.</li>

<li>Bake meatloaf in preheated oven for 30 minutes</li>

<li>Remove meatloaf from oven and drain liquids.</li>

<li>Top meatloaf with ketchup topping.</li>

<li>Return loaf to oven and continue baking until no longer pink in the center, about 30 minutes more.</li>

<li>An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgacfc851" class="outline-2">
<h2 id="orgacfc851">Zöldbab Krémmel Greenbeans With Cream Recipe</h2>
<div class="outline-text-2" id="text-orgacfc851">
</div>
<div id="outline-container-org618c9d0" class="outline-3">
<h3 id="org618c9d0">Link:</h3>
<div class="outline-text-3" id="text-org618c9d0">
<ul class="org-ul">
<li><a href="https://www.matildaiscooking.com/recipes/date/2018-04">https://www.matildaiscooking.com/recipes/date/2018-04</a></li>
</ul>
</div>
</div>
<div id="outline-container-org00117dd" class="outline-3">
<h3 id="org00117dd">Ingredients:</h3>
<div class="outline-text-3" id="text-org00117dd">
<ul class="org-ul">
<li>1 kg Greenbeans</li>
<li>1 Tablespoon of salt</li>
<li>2 Tablespoons of Oil</li>
<li>1 Tablespoon of butter</li>
<li>2 Tablespoons of Flour</li>
<li>250ml Fresh Cream</li>
<li>1 Tablespoon of Vinegar</li>
</ul>
</div>
</div>
<div id="outline-container-org49a2c29" class="outline-3">
<h3 id="org49a2c29">Directions:</h3>
<div class="outline-text-3" id="text-org49a2c29">
<ol class="org-ol">
<li>Watch this video: <a href="https://www.youtube.com/watch?v=RrlZqF47W8c&amp;feature=emb_logo">https://www.youtube.com/watch?v=RrlZqF47W8c&amp;feature=emb_logo</a></li>

<li>Watch Matilda for Directions: Total Cooking Time Approx 35-40 Minutes.</li>

<li>Ensure the beans are cooked before mixing together.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Samuel Banya</p>
<p class="date">Created: 2022-05-30 Mon 11:59</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
